{
  "session_id": "20250808_223303",
  "timestamp": "2025-08-08T22:33:21.089893",
  "profiles_scraped": [
    "https://www.linkedin.com/in/williamwgeorge/"
  ],
  "total_posts": 5,
  "posts": [
    {
      "post_number": 1,
      "content": "Authentic leaders are defined by their character and guided by their purpose. They lead with integrity, staying true to a deep set of values that shape their decisions and actions. These leaders build genuine, enduring relationships by fostering trust and connection, inspiring those around them to achieve their full potential.\n\nAuthentic leadership isn’t just about what you do—it’s about who you are at your core. It’s a commitment to lead with purpose, honesty, and heart.\n\nDiscover more by visiting",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "https://dms.licdn.com/playlist/vid/v2/D4D10AQFHz5e5w43LHA/mp4-720p-30fp-crf28/B4DZiLVkFMGkBw-/0/1754684352506?e=1755313200&v=beta&t=pKElUIMPRlS4YrkyA3RIeXWbVKGmoyXPwNn0u68qm2I"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/williamwgeorge/"
    },
    {
      "post_number": 2,
      "content": "The Wall Street Journal's recent article highlights a concerning trend: President Trump is publicly intervening in corporate decisions, even going so far as to call for a CEO's resignation. This creates immense uncertainty for business leaders.\n\nAs I shared with the WSJ, \"It's wrong for the president of the United States to be telling a major corporation's board to fire their chief executive.\"\n\nThis approach, unprecedented in modern American politics, forces executives to navigate an increasingly volatile landscape. Leaders must prioritize their integrity and the long-term health of their companies, not political appeasement.\n\nDiscover more about this shift and its implications in the article, here:",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/williamwgeorge/"
    },
    {
      "post_number": 3,
      "content": "A fact-based article on why Trump’s 39% tariff on Switzerland makes no sense. If you eliminate imports of gold bouillon and add in services, the trade balance is a mere $3 billion",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/williamwgeorge/"
    },
    {
      "post_number": 4,
      "content": "In the latest edition of my newsletter, I share how I've seen firsthand, true fulfillment in leadership comes when your personal purpose aligns with your organization's. This newsletter shares my own journey from striving for external success to finding genuine passion at Medtronic, and why nurturing your True North is essential for resilience, inspiring others, and defining your legacy.\n\nI invite you to explore these insights and reflect on your own passion for purpose. Read the full newsletter to learn more.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/williamwgeorge/"
    },
    {
      "post_number": 5,
      "content": "Has the Tesla board lost its sanity? The board just voted to give Elon Musk $23.7 billion to \"stay focused\" for two more years. \nSo now boards have to buy off their CEOs with $12 billion/year just to focus on the business??\nTesla stock is down 35 % since December in large part because Musk has not been focused on its business. Its vehicles are outdated and newer entries like the Cybertruck are not doing well. Meanwhile, Musk seems to have lost interest in the automobile business to focus on AI, robots and Robotaxis.\nMaybe Tesla needs to appoint a CEO that is truly focused on the business - not just for two years, but for the next decade. This move would let Musk focus on his other ventures and his political passions.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/williamwgeorge/"
    }
  ]
}