{
  "session_id": "20250808_221000",
  "timestamp": "2025-08-08T22:10:33.593207",
  "profiles_scraped": [
    "https://www.linkedin.com/in/brian-wong-26060b8a/"
  ],
  "total_posts": 50,
  "posts": [
    {
      "post_number": 1,
      "content": "Took this photo on a flight from London to Paris (Air France). Can't help but hear one of the most beautiful hymns to grace this planet reverberate in my ears:\n\n\"And did those feet in ancient times\nWalk upon Englands mountains green:\nAnd was the holy Lamb of God,\nOn Englands pleasant pastures seen!\"\n\nAn emphatic, powerful rebuke of industrialisation... a lamentation over days of yore... And, of course, a truly patriotic song (for many a Brit) - and it doesn't take a Brit to appreciate sound aesthetics and tunes.\n\n-- Jerusalem\n\nWilliam Blake was a true genius.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4D22AQEA7EPOaUecZA/feedshare-shrink_800/B4DZiEIdC7H4A0-/0/1754563471136?e=1757548800&v=beta&t=eg2eTfEkxpqMyzO49u30crJDCEGYku9TfoIvMIoDH_0"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 2,
      "content": "\"Should I submit something to Nature, or build a start-up focussing on experimental physics research?\" \n\nA senior STEM academic told me about a conversation he had with a 15-year-old mentee. The mentee was looking to apply for top US colleges, and their parents felt that they needed an external 'research partner' to help their child thrive at the CV-accomplishments stage... with a publication. My friend politely declined, yet offered to mentor the child for free.\n\nDon't get me wrong. Natural curiosity and adventurous audacity are deeply commendable. I also applaud those who are undeterred by stereotypes, that they are \"too young to think so deeply\", or that they should \"learn the basics first\", to embark upon intellectual Odysseys. Adolescence is about risk-taking. Growing up is about making mistakes. We should never deny opportunities to specialise and thrive in knowledge-areas to individuals, simply in virtue of their being high school students. Age is a construct. And academics should of course be duly compensated.\n\nYet let us not conflate such reasonable aspirations and interests, with a concocted push to 'excel' for the sake of securing coveted spots at coveted colleges. Indeed, the crux of the malaise rests with the very system itself - one that prizes apparently impressive 'accomplishments' and seeks to impose a veneer of objectivity over a fundamentally subjective range of variables, e.g. \"entrepreneurship\", \"character\", or \"community involvement\".\n\nIt is ludicrous that 14-year- and 15-year-olds are fretting over not securing seed funding for a brazen idea, or panicking because they haven't written for any \"externally accredited journals\" -- in their bids for a seat at the table. More so, it is unjust that there are many shut out of this wheel of churn, in virtue of their lack of access to resources or opportunities to stimulate their aspirations.\n\nTop colleges must of course vet students' academic potential holistically -- whilst acknowledging the value of non-academic accomplishments. Yet an over-fixation upon quantitative metrics and accolades, an under-examination of the intellectual malleability and openness (which the Oxbridge interview system can, in fact, approximate), when amplified by market structures and commercial incentives, could well give rise to a deeply distortionary, if not asphyxiating, experience for our next generations.\n\nIt is high time to reform admissions processes to bolster transparency, minimise unnecessary gaming, and encourage genuine interest in the subjects for which candidates apply for, or - in the case of US universities - an authentic passion for all-rounded learning, anchored in liberal arts values that are increasingly under threat from identitarian polarisation and reactionary politics. As for the public, we should take a leaf or two out of Markovits' \"Meritocracy Trap\", and recognise that the label of 'merit' endowed upon an individual by their degree, is by no means all there is to an individual.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 3,
      "content": "https://lnkd.in/gAvVvmg4 \n\nA few months back, I had the pleasure of visiting the one and only Prof.and speaking with him for the latest episode of's A New Look into ASEAN.\n\nKishore needs no introduction - he is a household name and known for his impeccable eloquence, long and illustrious diplomatic career, and mentorship for many. His penmanship is rivalled by few - his memoirs made for an excellent read. And of course, he is a generous friend who spared an hour in his afternoon for this conversation.\n\nI also raised some perhaps more unusual questions - from whether the vitality of the American civil society and resilience of its democratic institutions can withstand Trump's tenure, to what Kishore would say to his critics who accuse him of being too \"deferential on China\"; from whether ASEAN centrality can still hold under great power rivalry, to whether the proverbial West have failed to understand - yet again - the rapid rise of India, an emergent, non-Western, and potent power that will not easily accept others' instruction.\n\nIn the second half of the discussion, our conversation veered into the philosophical. We debated the merits of Karl Marx and John Rawls, mused over his personal interactions with the late Lee Kuan Yew, S. Rajaratnam, and Goh Keng Swee, and talked about why Hong Kong isn't predestined to be a political football.\n\nI was deeply struck and moved by his words on Hong Kong's future -- noting that there will be sizeable geopolitical obstacles and challenges ahead of the city, Prof. Kishore called upon our city's leaders to exhibit the wisdom and courage to steer the ship with more dexterity. Engage with those who are open to engagement in the proverbial West. Bolster and highlight our institutional distinctiveness from the mainland. And embrace a healthy dosage of realism in mapping out a future for Hong Kong in a more complex, less homogeneous, and hence more exciting world.\n\nAnd of course, I had to bring up the debate he had with Amb. Bilahari Kausikan and Amb. Tommy Koh - both highly respected veterans and sharp thinkers in their own right, with piercing insights on great power politics, China-US relations - on the agency and role of small states. As a \"Rebel, Rebel\", Prof. Kishore is no stranger to heated contentions and vigorous debates. His excelling in them makes him all the more a brilliant interlocutor.\n\nThrough Kishore's anecdotes, I also gained a rare glimpse into the formula for success for Singapore's long-standing ruling party -- the founding fathers made it a point to court and absorb bright, unruly, talented youth, including folks who would make \"good trouble\" and pose \"inconvenient questions\". Was it magnanimity or tactical foresight, or both? That's a question to be answered.\n\nVery much cherished the opportunity to discuss these issues with such a wonderful thinker whom I've had the pleasure of knowing from and first interviewed over 5 years ago.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQG64dpbBdMMCQ/feedshare-shrink_800/B56Zh6TbK6G4Ag-/0/1754398575266?e=1757548800&v=beta&t=PYKeqcDdyK9GjwyLu4JLctrCjeWiEexiVm4zJR7d1DQ"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 4,
      "content": "Very much enjoyed contributing towards the Governing the Real World Application of Medical AI Conference Report, published by the HKU Centre for Medical Ethics and Law. Many thanks to Gilberto K.K. Leung,,,, andfor the convening.\n\n\n\nExcerpt as follows:\n\n\"This paper suggests that in generating regulations and protocol governing AI usage, as well as conceptualising broader policies on AI adoption in medical contexts, policymakers should devise a set of discretionary principles that strive to satisfy four key objectives:\n\n1. Ensuring that infringements of the above four principles (Beneficence, Non-Maleficence, Autonomy, and Justice) are mitigated, and preventatively minimised;\n\n2. If the infringement of one or more of these four principles is inevitable, then there must be either a) sufficient compensation for such infringement that can be viably delivered to the affected party or b) reasonable justification for the tradeoff;\n\n3. Ensuring that the positive interests stipulated by each of these principles are proactively maximised;\n\n4. Providing for sufficient space for meaningful deliberation, quality debate, and viable disagreement between disparate stakeholders, to serve as check-and-balance against the formal powers of policymakers.\n\nThese principles are loosely arranged in a descending order of importance. The first and foremost consideration is ensuring that individual stakeholders are not deleteriously impacted by the incorporation of AI. Should infringements occur, they must be duly justifiable or compensated, such that they do not become violations.\n\nSomewhat lower down in the hierarchy of priorities come the advancement of upsides, as well as the maintenance of sufficient room for deliberation, debate, and critical scrutiny and reflexivity on the part of all involved actors. This is much needed to prevent epistemic violations and injustices within the doctor-patient, as well as more general, relationship within the medical context. The discretionary principles legislated by lawmakers in accordance with the above, would in turn give rise to what I term discretionary duties – morally demanding prescriptions weighty in force yet flexible with regards to their exact contents. Such duties are correlated broadly with pro tanto rights held by individual agents in public health contexts.\n\nEmphatically, such claims of duties and rights do not solely apply to frontline medical practitioners, but also those involved in using AI in medical research, training large language models on medical data, or advocating and lobbying for greater incorporation of AI across the board.\n\nFor example, on Beneficence and Non-maleficence, there exists a duty to ensure group match – i.e. data models used for medical diagnosis, prognosis, and prescription, should draw upon demographic data that reflects the particularities of their data.\"",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQGp4jZiMZyByw/feedshare-shrink_800/B56Zh5Zki5HQAs-/0/1754383404751?e=1757548800&v=beta&t=li6ZjhF93Aztvv2payEzGOA7ds--tgik6e_wEjfu5gs"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 5,
      "content": "A book project that has kept Heiwai Tang (AVP of The University of Hong Kong, Director of Asia Global Institute, and one of the most prolific economists I've ever met) and me busy over the past 2 years is putting together the following compendium, \"Towards A Future for BRICS+\", published by, headed up by the excellent. Here it is!\n\n//\"Yet to move beyond the cursory, to explain clearly what BRICS+ is and is not – especially given the extensive speculation, politicisation, and discursive hyperbole that have arisen in recent years – is by no means an easy task. Indeed, there is no reason to think that BRICS+ must be limited to its current membership, which, for the purpose of this book, will be construed as comprising the original five, as well as the batch of five nascent joiners in Indonesia, Iran, Egypt, Ethiopia, and the UAE.\n\nThis book is not intended to be an unequivocal defence of BRICS+, nor an impassioned justification for its precise composition. The core thesis of this book is certainly not that the world needs BRICS+, nor that each and every BRICS+ country is a member of this bloc for particular and wholly defensible reasons. We should be as wary of essentialist narratives that extol the triumphs and virtues of the bloc as we are of criticisms that take on a distinctively ideological and West- centric lens in castigating the bloc for being allegedly opposed to ‘the West’. Clearly, select members of ‘the rest’ have spoken out about their desire for greater strategic autonomy, and such autonomy need not come at the expense of Western interests. As such, the BRICS+ bloc is a given reality that merits phlegmatic and even- handed examination – of both strengths and weaknesses, value and disvalue.\n\nA corollary of this is that we should focus on BRICS+ as it has developed over the years: we could dwell on the merits and defensibility of the bloc’s having South Africa, but not Nigeria, as an early member. We could also pontificate over whether this bloc should have emerged in the way it did – with the perceived and actual outsized influence by China and Russia in its formation and evolutionary trajectory. Yet such discussions might not be as helpful as a focused interrogation of the implications or upshots of BRICS+ – taking into account in full its history, its present state, and its likely future prognosis and evolution. Given this, there are five distinct dimensions in which this bloc will be discussed throughout this book -- 1) geopolitical autonomy, 2) financial integration, 3) trade and supply chain synergy, 4) sustainability and energy transition, and 5) knowledge, data, and labour exchange.\"//\n\nWe are immensely grateful for contributions from the following authors:\n\nAbdul Razak Ahmad, Amitav Acharya, Anoop Singh,,, Jinhee Kim,,,, Manmohan Singh,,.\n\nOrder a copy here:",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQGIu_DUKjcmwg/feedshare-shrink_800/B56Zh0d2BrHkAk-/0/1754300638649?e=1757548800&v=beta&t=akM956MNwDtiePS-ys2VTZuJ0H9Oc_ObMzFvRI01M2o"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 6,
      "content": "Let's talk about the elephant in the room -- does Beijing want better relations with Europe? My take for China-US Focus: Probably, but not enough to convince it to change its fundamental tack on Russia.\n\n\n\n\"In his most recent visit to Europe, Wang Yi called upon Brussels to join Beijing in opposing “unilateralism and bullying” – framing Washington as a threat to their shared economic interests. A month or so prior, China announced it would lift sanctions on members of the European parliament – imposed during a vicious dispute over China’s human rights record a few years ago. These gestures reflect that Beijing is at least cognisant of the potential – and keen to signal its acknowledgment – of Europe as one amongst multiple \"poles\" in an evolving world order.\n\nMoreover, recent announcements by the Chinese State Council concerning price-based competition amongst EV makers seemingly reflect an appreciation of the perils of over-capacity – not only in the context of the domestic economy, where the leadership has noted the inefficiencies in skewing resources towards a few saturated sectors, but also given the opprobrium from foreign audiences. From the very top has come the signal that neijuan must be reined in – though questions remain over how this can be done.\n\nYet such sentiments do not thus entail a shift on Russia. Beijing may care about its relationship with Europe, yet its security-fixated leadership views as more weighty a concern China's standing in the \"great power rivalry\" with the U.S. As Wang declared, the more the U.S. and NATO allies are bogged down in Ukraine, the less energy and ammunition they have to \"encircle\" or \"tackle\" China in the Indo-Pacific. Indeed, one can also throw into the mix the prospects of a State Department and National Security Council team under Marco Rubio that is seeking to pull off a “Reverse Nixon” - alarming many in China wary of the rekindling of ties between the U.S. and Russia.\n\nBeijing's weltanschauung clearly ranks security above economics, and China’s weathering the onslaught of American coercion above the potential benefits China stands to gain from a more receptive Europe. Whilst such rankings are not inflexible, it would take some fairly sizeable upsides for Beijing’s priorities to be reversed. The incumbent leadership has become increasingly jaded about the strategic unity of the European bloc -- it is unconvinced that the payoff from courting Europe, via putting strategic distance between China and Russia’s militaristic aggression, would be worth the prospective downsides.\n\nFor European countries with deeply ingrained scepticism towards China, mere rhetorical shifts on the war alone will not cut it in nudging their populations to look the other way. For countries with long-standing ties with China, there is no need to duplicate efforts – if trade and investment can settle the question.\"",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 7,
      "content": "Thrilled to see my book, \"Moral Debt: Defending A New Account of Reparative Justice\", arrive in its physical hard copy (photo credits to a friend who ordered it!):\n\n\"This book does not intend to focus on the question of whether victims of present injustice are owed reparation for injustices caused directly to them. Instead, the primary focus concerns whether reparative responsibilities towards any currently alive and future individuals should arise as a result of the past injustices that affected their predecessors and ancestors.\n\nI take reparative justice here as denoting the responsibilities of neutralising and redressing in full the effects of discrete injustices. Reparatively responsible agents refer to those who possess duties, or – short of possessing such responsibilities – strongly normative reasons to advance reparative justice in relation to historical injustices. Understanding the answer to this question is important, for at least three distinct reasons.\n\nFirstly, we are interested in coming up with an accurate interpretive picture of the stakes involved – namely, in establishing whether the descendants, heirs,\nrelatives, or significant others of both perpetrators and victims, are in fact bound by any particular responsibilities or claims to one another.\n\nSecondly, unlocking a more refined understanding on this front thus allows us to make better direct prescriptions concerning how these actors should act in response: should the contemporary generation of responsible agents compensate, apologise for, and acknowledge the wrongdoings of their predecessors? To what extent should descendants of victims be afforded the much-needed redress in the form of opportunities or direct compensation – in reflection of their particular claims? These are questions that must be tackled methodically.\n\nThirdly, beyond the direct implications and prescriptions for the actors involved, there exists normative significance in the indirect prescriptions arising from these findings for third parties, including policymakers who are seeking to design institutions that are capable of registering the complex plurality of justice and responsibilities borne by citizens. The specific argument for reparative justice advocated in this book is by no means mutually exclusive with alternative conceptions of justice – whether they be rooted in the elimination and amelioration of structural injustice, achieving egalitarian or prioritarian justice on the part of present generations, and ensuring that the state is behaving in a minimally just manner to all citizens.\n\nYet just as there exists no reason to believe that reparative justice should always trump other considerations of justice, we should take seriously the force and weight of reparative responsibilities – independently of other future-oriented responsibilities, for example, to reduce distributive and relational inequalities.\"\n\nYou can order a copy here:",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 8,
      "content": "https://lnkd.in/gvPE_uFz\n\nMy interview with YB Anthony Loke, Minister for Transport and Secretary-General of the Democratic Action Party of Malaysia, is now up. It was a pleasure to conduct the conversation as a part of theA New Look into ASEAN Series II.\n\nYB Anthony is a terrific interlocutor and speaker (you should check out his Cantonese and Mandarin speeches if you haven't already). He is emphatically compelling, lucid, and extremely candid about both the opportunities and challenges facing Malaysia today.\n\nOur conversation covered topics including but not limited to:\n\n- How Malaysia is seeking to position itself as a regional transportation and logistical power - especially via pursuing over-land, aviation, and maritime connectivity with China via the rest of continental ASEAN;\n\n- How Anthony sees the future prospects for supply chain rearrangements and movements amidst intensifying Sino-American rivalry - and where Malaysia stands in relation to a rapidly evolving American presence in the regio\n\n- Working within the Pakatan Harapan to deliver changes that voters have long called for - and navigating internal differences and bottlenecks within the coalition government whilst catering to the DAP base\n\n- Tackling regional inequalities through logistical interconnectivity, especially for the East Coast and Northern constituents of Peninsular Malaysia\n\n- Can Hong Kong and Malaysia strengthen our already robust links - and how can the SAR add true value to its counterparts in ASEAN?\n\nYB Anthony is a generous and eloquent speaker who has spent much time interacting with and engaging prominent leaders from both the US and China alike. It was a pleasure to spend the afternoon with him.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 9,
      "content": "Had the great pleasure of delivering remarks on \"Steering through Uncertainty: Geopolitics and the Global Order\", with moderator Olivia Xia, CFA, at the Goldman Sachs Summer Series in Hong Kong on the topic, Shared my thoughts on the research and advisory work I do on a regular basis, with the 100+ bright and inquisitive second-generation future leaders in attendance.\n\nSeveral thoughts:\n\n1. China has overtaken the US to become the world's leading trading partner. In 2000, China's total trade volume was $474 billion, less than 25% of the US' $2 trillion trade volume at the time. By 2024, China's trade surged to $6.2 trillion, as compared with $5.3 trillion from the US. Whilst its domestic market remains fledgling and geopolitical headwinds render an export-dominant strategy ill-advised, China's significance in global supply chains cannot be overstated. In domains such as robotics, tech adoption-diffusion, and renewables, China is set to dominate in the coming decades.\n\n2. The search for agency does not require an end to unipolarity. The US remains a leading financial power -- in agenda-setting, norm-determining (and -defying), and shaping countries' choices through its financial prowess. Yet countries around the world are agitating for autonomy, through selectively playing the US vs. China, cursorily paying lip service to hegemonic demands whilst savvily optimising interests of domestic political actors. Argentina's coy courting of Chinese food imports - despite Milei's overtly US-affirming rhetoric, and Kazakhstan's dancing with the EU, Japan, and China whilst keeping a weakened Russia sufficiently mollified -- are two prime examples.\n\n3. Democracy does not guarantee development. AJR's \"Inclusive/Extractive Institutions\" thesis needs further fine-graining. Some systems are politically extractive whilst economically inclusive - pairing authoritarian centralisation on governmental, security, defense issues with laissez-faire deregulation and property rights enshrinement on economic issues. Even authoritarian systems come in diverse forms - whilst some are run by oligarchs, \"silovarchs\", or military juntas, others are steered by bureaucratic technocrats who align themselves with public interests via non-electoral means. Finally, \"inclusive economies\" built on extraction from colonies must be called for what they are; the 2001 AJR paper is intriguing, but flawed. Equating political liberalisation with development could be fatal.\n\n4. The AI order will become increasingly fragmented. Data and algorithmic siloing will intensify under the nascent military-industrial-intelligence complex embraced by different governments. The latest Shanghai AI conference reveals much in common between AI safety-regulation researchers in China and the US - cf. Geoff Hinton. Can we transcend political and ideological boundaries in tackling human-AI non-alignment, accountability deficits, and mitigating risks of AI proliferation amongst illicit actors? More on this later.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQHFYn3Ri4jIlA/feedshare-shrink_800/B56ZhUVomdHMAg-/0/1753761616274?e=1757548800&v=beta&t=ruXWecbn4xGwmvsDiHxwW2aXB_BHsLEkiwklJ0851vk"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 10,
      "content": "Got home after a very long flight back from London. Nothing beats the gorgeous sunset view from Hong Kong. What a skyline (and no, this is not the Victoria Harbour!).",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQHvnYYz4VSCxw/feedshare-shrink_800/B56ZhOYjPLHQAg-/0/1753661719873?e=1757548800&v=beta&t=cWsB0kmHq1wLdgsHpbXVIprnrWsm474Ro-zHHT0QWbI"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 11,
      "content": "https://lnkd.in/giBTJr2N \n\nFor China-US Focus, I argue:\n\n\"For the US, aligning countries with the zealously protectionist economic vision advanced by Trump could prove challenging; getting them on board in cracking down on re-exporting from China – an integral component of their economic growth strategies – is an order of magnitude more difficult.\n\nFirstly, proposed transhipment tariffs are hard to specify, and even harder to enforce properly. As always, the Devil lies in the details – of which there is unsurprisingly very little when it comes to how, whom, and by what metrics of measurements or evaluation these extra tariffs will be enforced. The crux of the matter often boils down to fine-grained footnotes to rules of origins, which stipulate the threshold percentages of value-adding transformation required for some goods to be deemed “produce in X” in part or in full. Thus far, limited information has emerged over what the exact enforcement mechanism looks like.\n\nShould Washington adopt a much broader interpretation of transhipped goods, targeting all products made in Vietnam that contain inputs and components from China, this could prove highly destructive towards the profit margins of Vietnamese firms in the electronics and textiles sectors.\n\nSecondly, Trump’s encirclement campaign has only reinforced the convictions of states in regional and mini-lateral blocs to double down on trade integration with their partner economies. The world is moving on.\n\nSingaporean Foreign Minister Vivian Balakrishnan spoke to such shifting sentiments at the recently concluded Foreign Ministers’ Meeting in Kuala Lumpur, where he called advocated that ASEAN must embark upon “a single production zone, a single investment zone”, reducing “tariff barriers [and] non-tariff barriers as well\", though this is perhaps easier said than done.\n\nTies are also deepening between regional blocs. On June 26th, EU Commission President Ursula von der Leyen raised the thought of linking the EU with the 12-nation Comprehensive and Progressive Trans-Pacific Partnership (CPTPP). The implicit thought is that the EU must diversify beyond merely infra-bloc integration and both China and the US, and develop synergies with both developed economies, such as Canada, the UK, Singapore, New Zealand, and Australia, and high-potential emerging economies, such as Vietnam, Mexico, and Chile.\n\nThirdly, U.S. pressures could well be lending ammunition to reform-minded technocrats within the Chinese state, who have long called for the propping-up of domestic consumption and expansion of the Chinese market for overseas producers. At Summer Davos in June this year, Premier Li Qiang pledged that China will become a “mega-sized” consumption power, doubling down on household spending in order to overcome growth bottlenecks and rebalance the economy.\nOne should only hope these voices of reason will in fact prevail.\"",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 12,
      "content": "There is no better place to be in the summer than this city of dreaming spires. Lovely to be back!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQFhs0Lil_gU6g/feedshare-shrink_800/B56ZhBSGW7HcAg-/0/1753441943377?e=1757548800&v=beta&t=iROcJrkIjEGfGMyFfq2zH9lbGjwJHVeD6Je4ORu0QSE"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 13,
      "content": "During my latest trip to KL, I had the pleasure of joining Sayed Munawar, a celebrated talk host and media personality, to share my thoughts on a book that I'd like to recommend to the Malaysian public. I greatly enjoyed discussing's The New China Playbook: Beyond Socialism and Capitalism - an accessible yet rich read for folks who want to understand China.\n\nThe Telaah podcast is part of the Malaysia Madani programme, envisioned by Prime Minister Anwar Ibrahim (guest of Episode #1) to be a key platform for intellectual discourse. My several observations about the book (and China):\n\n1. The best takes on China are those that grapple with both its strengths and flaws. Far too often we read accounts that slip into caricatures of the country - from the triumphalist \"China is extraordinary and will prove the West wrong!\" to the eschatological \"China is doomed, it will collapse soon\"; from those who ignore structural weaknesses and the perils of ideologisation in Chinese economics, to those who hype up indefinitely the \"China threat\". Keyu's book eschews these simplistic assertions and opts for nuance. So should we.\n\n2. Tempting as it may to view China through lenses of didactic, rigid state control, you'll easily realise that the \"individual\" is real when you walk on the streets parading Labubu or the latest foldable Xiaomi phone in Shanghai, or frequent the queer clubs and feminist book clubs in Chengdu. The individual in China is the product of constant negotiations and careful navigations between official red-lines, unofficial grey lines, and culturally imposed green lines. Keyu's \"Consumer-State-Business\" triangle is fascinating, for it restores agency to the often-homogenised bloc of 1.4 billion people.\n\n3. The \"Pendulum\" may not be an always-accurate metaphor, but it does reflect the complex considerations and forces shaping the bureaucracy. Top-down accounts attribute far too much intentional agency to senior actors in Beijing. Bottom-up accounts positing a lack of democratic institutions ignore non-democratic institutions for opinion gathering and expression, but also the performance legitimacy pressures for provincial and local officials. Such pressures, and resultant \"churn\", have only increased with the pluralisation of KPIs - security is now coming to the forefront, and growth no longer comes first. Yet such shifts are neither innately irrational, nor determined by any single individual.\n\n4. Sino-West engagement has benefited not just a large number of Chinese citizens born post-1980s. It has also introduced innovation and ideas to China's (fledgling) financial infrastructure, expedited its long-overdue domestic reforms, and accelerated China's progress towards letting the world see and hear it for what it is - with both bright spots and blemishes. We should remain cautiously optimistic about the willingness of younger generations from both countries to see past bombastic chauvinism.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQHJ_TPCFig7Ew/feedshare-shrink_800/B56Zg7U1RNG0Ag-/0/1753341975674?e=1757548800&v=beta&t=7-nobHZDMVPPS3Dv39ydpGNexvbSIU8WXRs0Tr07v1Y"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 14,
      "content": "My interview with Ibu Dr. Mari Elka Pangestu for the New Look into ASEAN series with Radio Television Hong Kong (RTHK) is now out. We had a riveting and stimulating conversation on the following topics:\n\n- How is Indonesia dealing with the tariff pressures from DJT and the unfolding Sino-American rivalry?\n\n- How confident should we be about the very ambitious growth targets set out by Prabowo for the Indonesian economy?\n\n- Why did Indonesia opt to join BRICS+, given the skepticism of many towards its ability to provide substantive gains for member states?\n\n- How will Indonesia's role in ASEAN continually evolve over time?\n\n- Can Indonesia and Hong Kong do more together, with Hong Kong a critical, open, and small economy that should leverage its financial infrastructure in serving Indonesia?\n\n- Any advice for aspiring public policymakers and economists?\n\nThe organic dialogue took place in the wonderfully tranquil setting of Ibu Mari's residence. It was a pleasure to spend the afternoon with one of the most formidable technocrats and economists to have emerged from Southeast Asia over the past 50 years. Piercing insights from a profound intellectual.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 15,
      "content": "In a week's time, I'll be embarking upon my book tour, for Moral Debt: Defending a New Account of Reparative Justice (Routledge, 2025).\n\nI am honoured and grateful for the opportunity to share with the Rhodes community my work on September 16th, at 1400 BST. This event is free and open to the public. Indeed, in the book I hope to do justice to the many heated debates surrounding the Rhodes Scholarship, and its complex legacy.\n\n-----------\n\nI am also incredibly grateful for the following endorsements:\n\nProf. Amitav Acharya, \"The issue of reparative justice for past atrocities is central to building a more just and inclusive world order. This book offers one of the most powerful yet nuanced arguments for making select groups and individuals at present ‘pay’ the moral debt, enriched by case studies from around the world. It is essential reading for scholars, activists and leaders in the West and the Global South.\"\n\nDr., \"“Brian Wong’s book offers a spirited discussion of historical debts tied to colonialism. While such debts may not require literal repayment, Wong pushes back against the excuse that colonialism has some positive legacy. This reasoning overlooks the enduring inequities wrought by exploitation. Blending philosophical rigor with deeply personal insight, the book challenges readers to confront uncomfortable truths about history and responsibility. A compelling and rewarding read by a young scholar, who invites us to reflect on reconciling the past while striving for a just future.”\n\nProf. Daniel Butt, “Moral Debt is a tightly argued and persuasively written defence of the claim that present generations can bear weighty duties of reparation stemming from past acts of wrongdoing. Brian Wong blends theoretical and empirical material to fine effect: the result is a new account of reparative justice with the resources to deal with many common objections from the worlds of both theory and public policy. A major contribution to the political theory of historic injustice.”\n\n, “Reparations are increasingly relevant as a topic of public interest. Dr. Brian Wong’s book draws creatively upon methods in political philosophy, social psychology, and comparative politics, in examining ways in which moral debt can be developed, transmitted, and inherited over time. I would highly recommend this thought-provoking work.”\n\nProf. Jeffrey Sachs, \"Brian Wong does a great service in providing a sophisticated discussion of the possible moral bases for holding current generations responsible for past crimes, and the ways that reparative justice may be realized. The debate over reparative justice is sure to intensify, and Wong’s important book will provide key ideas in the ongoing worldwide debate.\"\n\nDo sign up here:",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 16,
      "content": "My absolute pleasure. I think it's high time for HK to wake up to and grapple with the many opportunities and plenty of lessons we can learn from our neighbours to the South. Having spent only 4 hours door to door between my hotel in Hanoi and my residence in HK on my commute today - HK-ASEAN infra-day commute for work and leisure is not a pipe dream.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQEKwPrgY0GCag/feedshare-shrink_800/B56ZgiQGoNHcAg-/0/1752921304241?e=1757548800&v=beta&t=zJf43UWD-YQ_oJf782-gvfwtHgK1KIVqi0SdSfwnnlA",
        "https://media.licdn.com/dms/image/v2/D5622AQH8s9sWA7n1dQ/feedshare-shrink_800/B56ZgiQGpMG4As-/0/1752921304506?e=1757548800&v=beta&t=OZAST93LDdh821CWQr7KDDcm0ui3GWcbITO7AtmxqQk"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 17,
      "content": "I have gotta say, this is the busiest I've seen the Hong Kong Book Fair. Great to be back and to bump into many good friends amidst the hustle and bustle. Madame Long Yingtai 龍應台 delivering a public lecture to thousands of eager audience right now!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQE1a8K4okvzBg/feedshare-shrink_800/B56ZgiCa9VHkAg-/0/1752917727834?e=1757548800&v=beta&t=I8vX_atrFZ12XLofy8S21cawr5yTzyWjwdWHUydLosM"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 18,
      "content": "An honour and pleasure to meet with and learn from Madame Nguyen Minh Hang, Deputy Foreign Minister of the Socialist Republic of Vietnam, in a feature interview. A robust and invigorating conversation in which we discuss the future of this mesmerising country of over 100 million individuals. Madame Nguyen is an eloquent and highly thoughtful diplomat. Tôi yêu Việt Nam!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQHZUAK1nDCtIQ/feedshare-shrink_800/B56Zgc4VooG0As-/0/1752831189418?e=1757548800&v=beta&t=Ltm1QJNQrpi4AgpP5039XhHJ0vYJFK6nP32YwGhVFw4"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 19,
      "content": "Enjoyed a scrumptious lunch in the Hoan Kiem district of Hanoi - despite the soaring temperatures (35 celsius!!!!) and humidity on the streets, nothing beats an authentic bowl of pho: delicious and fragrant, with extremely zesty flavours. The hustle and bustle of Ly Quoc Su make the experience all the more enriching. Now savouring a gorgeous cup of egg coffee.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQE5TdEcB8WX5g/feedshare-shrink_800/B56ZgcDHi0HcAk-/0/1752817298401?e=1757548800&v=beta&t=_wLoYI-k170Qqx4Rf5TSDUaxs1Mlu-pHOzIIJtU6d2w",
        "https://media.licdn.com/dms/image/v2/D5622AQEJntn1HYicHA/feedshare-shrink_800/B56ZgcDHjYHcA4-/0/1752817312782?e=1757548800&v=beta&t=I2mwbJYKym2xOXbSx7h79wKQLOAabB087lRn8pKFT_8"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 20,
      "content": "There are few better meals than an authentic bowl of bun cha and nem cua bể, especially one that's downed with a can of coke -- followed by Vietnamese drip coffee. Love being in the Old Quarter of Hanoi -- so chaotic, so fun, and so rustically charming. Now off to an evening stroll amidst the labyrinth of roads, alleyways, and motorbikes!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQFGToZAgPaklA/feedshare-shrink_800/B56ZgYn.NRG0Ag-/0/1752759946484?e=1757548800&v=beta&t=Y9h7kAmWFA4lkSHxo01YVaUpcG8Gnj48q7PbkjbJjY0",
        "https://media.licdn.com/dms/image/v2/D5622AQEO4ruWjlqMeg/feedshare-shrink_800/B56ZgYn.M0IAAg-/0/1752759790705?e=1757548800&v=beta&t=draHiyM6Cmxta7tEJgflvtzGdCeYKnDYB9oge2a5e0k"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 21,
      "content": "https://lnkd.in/d2apm7g2\n\nWhen I sat down with the Thai Deputy Prime Minister and Finance Minister Khun Pichai Chunhavajira in Bangkok in Q1 this year, neither of us foresaw the incredible turn of events that would ensue - with both the Trump tariffs and the ongoing Thai political crisis.\n\nSo our conversation was naturally drawn to discussions over the Thai economy - its abundance of resources, but also its multitude of challenges. We looked at how long-standing political instability (now all the more salient) could affect investor confidence and undermine sustainable growth. Indeed, the numbers don't look pretty. I also probed him for his thoughts on cross-border crime, the undermining of checks and balances, and case for lifting restrictions on foreign ownership to spur real competition.\n\nThe (edited) discussion has now been published and can be viewed here. This is the first episode of theA New Look into ASEAN II - a series that strives to raise the level of public understanding and awareness of ASEAN, as well as the ability to engage with the plurality of views and ideals in the region, for Hong Kong denizens.\n\nThere is much more to the world than the US or China. Hong Kong must be more than just a bridge or connector. We must be better listeners and facilitators, to tap into the wisdom of our neighbours and friends down south. We spend far too much time faffing on and fixating over geopolitically unmoveable aspects of the international equation, and overlook unduly ways in which we, as Hong Kongers, can and must speak up internationally. With this programme, I hope I'm contributing a small part to altering this status quo.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 22,
      "content": "For South China Morning Post SCMP, I argue:\n\n\"In September 2023, Hong Kong’s Court of Final Appeal ruled that the government must establish a legal framework to recognise same-sex relationships within two years – affirming the rights of same-sex couples to apply for public housing and inherit property. The ruling also explicitly stated that such recognition does not entail the legalisation of same-sex marriage.\n\nGovernance under the rule of law is treasured, for it allows for the implementation of decisions and enshrinement of rights independent of any particular ideology or value commitments. For instance, a committed Christian is unlikely to see eye to eye with a Hindu or Muslim over their religious ideals and tenets. Yet if the court rules in favour of secularism and the accommodation of different belief systems, all citizens, religious or non-religious, must be bound by the ensuing laws of non-discrimination and inclusion.\n\nIn that spirit, some legislators who personally disapprove of same-sex marriage have backed the government’s decision.\n\nChief Executive John Lee Ka-chiu has made the courting of top overseas talent a core part of his policy platform, and rightly so. Recently, he pledged to be “innovative in advancing reforms”.\nA 2023 Ipsos survey found that nearly one in 10 adults across 30 countries identify as LGBTQ, primarily younger respondents and those in more progressive countries. Such results should not be construed as indicative of fads. A devout Catholic does not give up believing in God merely because he joins a heavily atheist community or company. He certainly should not be required to.\n\nIf passed, the government’s proposal will strike the right chord with talent interested in working in East Asia, an economically dynamic yet largely socially conservative region. It would put Hong Kong among the most LGBTQ-friendly and culturally tolerant Asian cities – attesting to the results of a recent index commissioned by the Hong Kong General Chamber of Commerce.\n\nThere is certainly substance undergirding our reputation. In 2023, a survey found that 71 per cent of respondents believed Hong Kong should have a law to protect against sexual orientation discrimination, up from 69 per cent in 2017 and 58 per cent in 2013. Only 6 per cent explicitly disagreed.\n\nThere is no mutual exclusivity between respecting religious freedoms and the common courtesy of not making life extraordinarily difficult for individuals who want to be a part of the Hong Kong story.\n\nThe government policy would grant only the most basic of recognitions to same-sex couples, in bereavement arrangements and necessary medical decisions. As for the separate discussion of same-sex marriage, I certainly enjoy in-depth, candid discussions with those who see it as innately un-Chinese and un-Asian – where we can examine plentiful examples of homosexual relationships in ancient China, or the deeply colonial roots of homophobia. Yet this would be discussion for another day.\"",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 23,
      "content": "Always a pleasure to be back in KL - especially in coincidence with the ASEAN Foreign Ministers' Meeting, held right here at KLCC, over three days last week. More thoughts on the fascinating developments to come...",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQFqddMrUW188Q/feedshare-shrink_800/B56ZgGoYwgHcAg-/0/1752457909898?e=1757548800&v=beta&t=uBUfYBaFEvLZBTfHvzt5zPlpFOkKcQoElVgscDRXE3w"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 24,
      "content": "Attempted to do something rather swelteringly hot two days ago - walked from the (yet to be opened) Merdeka 118, through Chinatown and Petaling Street, past Dataran Merdeka and the Historical District, past SOGO and up to Chow Kit and Kampong Bharu, prior to walking all the way back down to TRX. Stopped by Kinokuniya in Suria KLCC for a leaf-browsing hour. Surprisingly walkable, setting aside the temperatures (35 Celsius!). 10km of solid exercising. Pictured here is an image of clear juxtaposition -- between the towering Merderka 118 and... the hustle and bustle of Chinatown (where I had delicious laksa). Bring plenty of water and maybe an umbrella.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQE5aOFiuP2rrQ/feedshare-shrink_800/B56ZgB_YCSHIAk-/0/1752380056241?e=1757548800&v=beta&t=dua9NHsIF0bNxd9N-R82xF0KmI4-34DqTckqmyH9z3A"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 25,
      "content": "My assessment of Keir Starmer's US-China policy, for China-US Focus:\n\n\"The considerably warmer and more pro-engagement stance of the Labour government towards Beijing, is perhaps best explained by the significant domestic economic pressures that the U.K. now faces. Whilst the economy grew more than expected in the first quarter of 2025, initial estimates for April suggested that the economy shrank by 0.3%, the steepest decline since October 2023. Many have attributed this to the deleterious impacts of Trump’s mercurial tariff regime on the global macro-environment, which has dampened broader investor sentiments. Given China’s immense (albeit hitherto untapped) potential as a consumer market and significant technological advantages in areas such as robotics and renewable energy, it would make economic sense for Starmer to pursue a more balanced China policy than his predecessor.\n\nWe should not construe the entente between China and the U.K. as signs of the latter’s fundamentally pivoting away from the U.S.. Indeed, at the recently concluded G7 summit in Canada, Trump and Starmer officially signed off their trade deal, with Trump declaring that the U.K. would be immune from future tariffs, “because I like them.”\n\nMuch hard work went into this deal, which was the first agreed upon by the U.S. and another prominent power in the world (amongst the top 10 economies in the world by total GDP size). It took an official visit by Starmer, coupled with a cordial letter from the King, as well as acquiescence by London on its steel sector (slapped with 25% tariffs by the U.S.), in order for Trump to recognise and affirm the value within the “Special Relationship.” Much of the special-ness probably came down to the effervescent rhetoric with which Starmer strategically placated Trump.\n\nThe product of the negotiations could have been much worse for Brits. Tariffs have decreased from 27.5% to 10% on U.K. car exports to the U.S. – its largest export. The British aerospace sector was exempted altogether from the baseline 10% tariffs. Yet the biggest winner from these negotiations was probably the beleaguered administration. Whilst the U.K. remains an important financial, technological, and intelligence partner for the U.S., Starmer needed the negotiations to be swift and visually successful, in order to clinch a crucial PR victory against an onslaught of unfavourable domestic political setbacks.\n\nIt would be erroneous to read too much into London's approach to Sino-American relations. There is no diplomatic “Grand Strategy”. The foreign policy of the incumbent is rooted in a pragmatic yearning for optical (and perhaps economic) returns. A case in point would be the “landmark deal” heralded by Starmer between the U.K. and the E.U., which promised – yet perhaps struggled – to cut the red tape that had emerged post-Brexit.\"",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 26,
      "content": "Enjoying a gorgeous evening out in KLCC at the 2-Michelin Star Dewakan, which served one of the most irresistible and unimitable desserts I have had in years: a cacao-less chocolate made with dabai, seved with rose fudge in a tart shell made with heart of palm and keluak. Arguably my most memorable meal yet in Kuala Lumpur, and I've been in this city many, many times.\n\nA great meal cannot go without a terrific read - especially one as scintillating as's riveting \"Empire of AI\". Intrigued by the implications of powerful actors on global AI development? Grab a copy whilst you can: Karen is a fantastic thinker, journalist, and writer and asks deeply provocative in her page-turning coverage of OpenAI's ebbs and flows.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQGVHv45jk1KDw/feedshare-shrink_800/B56ZfvwjtlHcAg-/0/1752074180415?e=1757548800&v=beta&t=ezqyEr_KPImPuE-z1LyGivZlvL3t3l3NKUKBbAo_hyY"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 27,
      "content": "My final interview before my proper holiday (starting today!) was with the Vietnamese national television VTV 4 - on the subject of Vietnam's becoming a partner to BRICS. Whilst the eventual broadcast remarks were brief, my detailed thoughts are as follows:\n\n1. Vietnam is the doyen of \"bamboo diplomacy\". Its official accession to BRICS as a partner should be seen as one amongst a basket of moves embraced by its incumbent leadership to signal maximal strategic ambiguity and openness to alignment - but not alliance - with countries in possession of conflicting geopolitical tendencies. Vietnam is the first ASEAN country to secure a trade deal with Trump's White House; Vietnam cooperates closely with the US over security (cf. the South China Sea). It is not \"taking sides\" by joining a dialogue platform - instead, it is optimising optionality.\n\n2. The BRICS Summit this year featured a healthy range of agenda topics - from financial multipolarisation, consolidating new-old energy synergies, to shoring up trade resilience amidst protectionism and unilateralism from the White House (in the clear minority of actors feeling threatened by BRICS is Trump, who threatened an extra 10% tariffs on \"BRICS members\"... for being \"anti-US\" - so long, rhetorical finesse over financial weaponisation). Yet whether such \"talk\" materialises in more concrete measures rolled out by the NDB or via bilateral financing/energy/trade agreements remains to be seen.\n\n3. Foreign policy is an extension of domestic policy. Under General Secretary Tô Lâm, much emphasis has been placed on Vietnam's bureaucratic downsizing, moving up the value chain, enhancing human capital via higher education, bolstering the confidence of international investors and domestic enterprises. Some have called this platform Đổi Mới for the 21st century. Flanked by the sturdy and charismatic technocrat Phạm Minh Chính, whose remarks I had the pleasure of hearing at Summer Davos this year, the current \"Four Pillars\" of the Vietnamese leadership are seeking to unleash domestic productivity whilst avoiding the mistakes of more ideologically fixated counterparts.\n\n4. BRICS is at risk of over-expansion. The Sino-Indian and, to a lesser extent, UAE-Iran dyads within the bloc call for careful handling. In theory, much upside can be gained from the world's two most populous (and, dare I say, high-potential) economies working hand-in-hand. In practice, domestic political calculus and a desire to project strength could well impede efforts aimed at a serious thaw between technocrats, civil societies, and the peoples of China and India. It is high time for BRICS to stop, reflect, and consolidate - size is not what matters: what is non-negotiable, is the substance delivered.\n\nI have the utmost respect for the people of Vietnam, a 100-million-strong manufacturing powerhouse with incredibly rich cultures and historical legacy, and look forward to visiting my good friends in Hanoi and HCM before long.\n\n(Edited out typos)",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQFXxDJ8ZLesDQ/feedshare-shrink_800/B56ZfudSnXHQAg-/0/1752052346180?e=1757548800&v=beta&t=sUrv2grbiiWywBX4_lP_9ex27rJz55EsOSHcGQqdDWY"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 28,
      "content": "Had a pleasant conversation with CNN on the recently concluded BRICS+ summit. Bottomline: it's imperative that we avoid according too much importance to this fledgling geopolitical bloc, which is as intriguing as it is caught up in internal divides, schisms, and non-alignment. With that said, a couple of observations:\n\n//In Rio, Chinese Li Qiang will likely be charged with advancing priorities like shoring up energy ties between Beijing and BRICS’ major oil-exporting members, while pushing for the expanded use of China’s offshore and digital currency for trade within the group, according to Brian Wong, an assistant professor at the University of Hong Kong, who added that Xi’s absence shouldn’t be interpreted as a snub to BRICS.\n\n“Whether it be the Sino-Russian partnership or Beijing’s desire to project its purported leadership of the Global South, there is much in BRICS+ that resonates with Xi’s foreign policy worldview,” said Wong, using a term for the extended group.//\n\nThis worldview, to be more precise, is not so much an attempt to create a comprehensive and coherent 'alternative' to the West-led order, as to stake out more autonomous bargaining capital vis-a-vis existing West-led institutions. Whether such bargaining prowess translates to material benefits, and whether these benefits can in fact be accrued to the Global South, as opposed to a few large states that dominate the BRICS+ bloc, remains a separate question.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 29,
      "content": "https://lnkd.in/gNxrjpag \n\nLooking forward to delivering a keynote lecture on ASEAN - a region about which I care deeply - for theGeopolitical Intelligence series.\n\nWe will be covering:\n\nWhy ASEAN Matters – Supply chain resilience, critical minerals, and the study of geopolitical geography\nChina-ASEAN Relations – From Belt and Road to RCEP, from G77 to BRICS+: shifting sentiment and strategy\nGrowth Opportunities – Regional (horizontal) and sectoral (vertical) opportunities for firms\nCultural Intelligence – Local political and societal dynamics that impact business outcomes\nHong Kong’s Role – Unlocking cross-boundary collaboration and market entry pathways\n\nThe lecture will take place on next Wednesday, from 1430 to 1730. Registration available here:",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 30,
      "content": "https://lnkd.in/gNrY8_NZ\n\nFor China-US Focus, I argue that free trade can survive Trump 2.0: \n\n\"We are often told that the return to power of U.S. President Donald Trump marks the “death knell” in globalisation – that the halcyon days of unbridled free trade, which had exploded subsequent to the end of the Cold War in 1991, have not only peaked, but are fundamentally over. This narrative is not wholly erroneous, though the frequent rehashing of it tends to lead to fatalistic and flawed predictions.\n\nFirstly, whilst Trump may be predisposed towards more trade restrictions and limitations, he is also kneecapped by domestic political considerations. Though early signs certainly suggest that Trump’s erratic first 100 days have been less inflationary than anticipated, the real threat kicks in as he confronts the prospects of a declining stock market amidst escalating bond yields, in reflection of the systemic destabilisation of the long-held market wisdom that U.S. Treasury bonds are safe assets amidst macroeconomic turmoil. Pressure exerted upon him by domestic automobile manufacturers hampered by China’s weaponisation of rare earths has also contributed towards a drastic U-turn over recent weeks.\n\nSecondly, Trump’s victorious return is but a symptom – and not the sole cause – of much deeper antipathies towards free trade amongst disillusioned citizens in the post-industrial West. Within-country inequality has become increasingly preeminent, as compared with inter-country inequality – in reflection of the fact that even amongst the poorest of countries, globalisation has enriched the privileged elite, whose success is widely viewed as having come at the expense of the less privileged within their communities. Trumpism, rooted in moralised grievance, propelled by nihilistic rage, is hence a manifestation but not prime promulgator, of such underlying dynamics.\n\nThirdly, the rest of the world is proceeding accordingly with forming new trade agreements in the absence of the U.S. Take the two natural resource-rich regions of Southeast Asia and the Arabian Gulf as examples. The Gulf Cooperation Council (GCC) and the Association of Southeast Asian Nations (ASEAN) have been vocal in not just talking up but also committing to increasing bi-regional trade between the 10 and 6 economies, respectively. Projections suggest that GCC-ASEAN trade will surge from $13 billion in 2020 to $682 billion by 2030, clocking in at 7.1% annual growth per year over the ten years.\n\nFree trade agreements free from the U.S. will continue to rise and thrive. Today, the largest trade agreement (in terms of total economic size and population) in history does not include the US – it is the Regional Comprehensive Economic Partnership (RCEP), which benefits immensely from the technological advancements of China, Japan, and South Korea, as well as the manufacturing prowess of emerging powerhouses in Southeast Asia.\"",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 31,
      "content": "Took this snapshot of the sunrise on a flight back from Paris to Hong Kong today. \n\nA new year's resolution I've made for myself is to learn to give myself a break. The past six months have been a thrilling ride - new books, new projects, new courses, new friends, new ideas, new imagination. But also learning to say goodbye - old ignorance, old obstacles, old habits, once friends, old dogma, and old challenges and trauma. Coping with loss and grievance hasn't always been easy - but I have always managed through the mantra from Journey: \"Don't stop believing.\" Belief precedes action, which precipitates change - one way or another.\n\nNot having taken more than a day off a week since December last year, I am very much looking forward to taking a week off for my annual leave -- and undergoing a long overdue digital detox! Don't forget to give yourself a break!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQHpr_v6iMF-ig/feedshare-shrink_800/B56Zfa.kxRG0Ag-/0/1751725530827?e=1757548800&v=beta&t=bB6_lyffnfba5jgAyPt6YgNVio4L-LpC1NE6ExR1kgM"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 32,
      "content": "What sparks joy?\n\nI think joy is best sparked by doing what one loves doing: talking, debating, and bickering over intricacies of topics of interest that one spends much time in a day thinking about.\n\nI had the pleasure of co-teaching alongside some excellent colleagues the Philosophy of AI Summer School hosted at the gorgeous campus of University of London Institute of Paris, helmed by the wonderfuland co-organised by the Institute of Philosophy, UoL and Department of Philosophy, The University of Hong Kong. Our faculty included leading philosophers working on the epistemics, metaphysics, and (as with I) pragmatics of AI. What a joy to be in the 7th for the occasion.\n\nInand my joint lecture, we discussed the significance and implications of AI for global geopolitics - and presented four reasons as to why AI researchers, ethicists, and theorists should care about all of this:\n\n1. Funding. Funding in the AI space is increasingly geared towards security-centric projects. Securitisation is the most effective means of raising quick liquidity. Safety, alignment, and more hidden risks in AI development have been somewhat swept to the side as governments - in conjunction with Big Tech - race to appropriate cutting-edge AI as potentially weaponisable bargaining chips. Geopolitics dictates capital flows.\n\n2. Application. Whether it be usage of AI in wars (drones, cyberwarfare, intelligence analysis), psyops (disinformation, misinformation), and even strategic risk forecasting, geopolitical flashpoints are increasingly saturated with a perilous degree of automation. How can we ensure that powerful agents are not triggering secondary risks through intentional or inadvertent usage of AI in pursuit of blitzkrieg victories or enduring bargaining advantages?\n\n3. Regulatory. Given the proliferation of non-state actors - including terrorists, criminals, but also corporations behaving with overt impunity and blemished track records - how can we effectively regulate AI development and usage, in a manner that strikes the right balance between reining in state overreach and preventing private excesses? Is there a fourth way beyond the Chinese, American, and EU approaches? What teeth is there in a global regulatory regime?\n\n4. Enemies over Existence. Popular discourses emanated by the new military-industrial complex portray \"winning at any cost\" against geopolitical adversaries as the key mission for strategic AI development. Yet no one wins from an unbridled race to AGI or ASI - which could give rise to substantial x-risks through many hitherto unresolved alignment problems. And what of small and medium states who do not want to choose sides, or kidnapped into a technological Cold War? If we are to respect the agency and autonomy of peoples as general guiding principles for AI regulation, we must extend our concern to the geopolitical arena.\n\nI look forward to contributing towards invigorating debates on these questions in the coming years.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQFvZOxphqwvfg/feedshare-shrink_800/B56ZfZKux9GQAk-/0/1751695159949?e=1757548800&v=beta&t=y4QAhcqMQp25dEmkSozU63xIj-Ww0RdgCxL4CkPMyuI"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 33,
      "content": "A pleasure to catch up in-person with Amb Pierre Andrieu, Non-Resident Senior Fellow on China-Russia Relations at the Asia Society Policy Institute’s Center for China Analysis, and Former French Ambassador to Tajikistan and Moldova. A wonderful conversation in a breezy Parisian evening!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQFLCxnzzc6H3Q/feedshare-shrink_800/B56ZfUgMoFHQAk-/0/1751616906472?e=1757548800&v=beta&t=CUbWmMQTCfN4aBcUEsJS3TuQpSgxnm--1wRTUqUx4dM"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 34,
      "content": "Shared my views on the US-Vietnam trade deal with the excellent Financial Times:\n\n//Analysts warned that the Vietnam deal, as well as others that Beijing deems as endangering its interests, could also undermine US-China trade talks. Trump recently claimed a tariff truce with Beijing had been signed, but concerns remain over Chinese restrictions on the flow of rare-earth exports and US export controls on advanced technology such as semiconductors.\n\n“This could certainly lead to a renewed escalation of US-China trade tensions if the US insists on very stringent restrictions by third parties on imports from China,” said Frederic Neumann, chief Asia economist at HSBC. Adam Sitkoff, executive director of the American Chamber of Commerce in Hanoi, said it was a positive sign that Vietnam had locked in a deal ahead of the deadline, avoiding the situation of countries such as Japan, which Trump again this week threatened with higher tariffs.\n\nKey for Hanoi will be how the 40 per cent trans-shipment levy is enforced. Trans-shipment is difficult to trace and the Trump administration has not said how it defines the practice, though it has made the issue a priority in trade talks with Vietnam and other south-east Asian countries.\n\nBrian Wong, an assistant professor at the University of Hong Kong, said Chinese officials knew the US would have trouble enforcing the trans-shipment measures, given the complexity of global trade and the ease with which companies can bend the rules.\n\n“The devil lies in the details of enforcement as opposed to the agreements,” said Wong, adding that Beijing’s outraged rhetoric was mainly “performative”.\n\nFor Vietnam, Sitkoff noted that many details of the deal remained unclear, such as whether the 20 per cent tariff was a final amount or if it would be applied on top of existing levies, as well as which products would be subject to the 40 per cent charge.\n\n“Assessing the pros and cons of the deal is difficult without seeing further details about what the tariffs actually mean,” he said. “Do the 40 per cent tariffs on ‘trans-shipped’ goods apply to any product that contains content from another nation? The answers to these questions can be the difference between celebrating or crying.”//",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 35,
      "content": "https://lnkd.in/gMcCMaMn\n\nIt was a pleasure to speak with Jonathan Midgley - a stalwart of Hong Kong criminal law and an excellent Podcast host - for theLaw Matters series.\n\nOur conversation - in two parts - took us to some fascinating corners. We talked about the importance of the rule of law and common law and why Hong Kong needs to work extra hard in keeping itself legally, institutionally, and economically unique - within feasibility constraints.\n\nWe also pondered over the extent to which Chinese and American soft power has evolved over times - under a mixture of geopolitical factors, civil society exchanges, but also the emergence of a sprawling, chaotic, but fundamentally vivacious Global South.\n\nFinally, I discussed my path to higher education - and why I chose to study PPE (and political theory) upon realising that old playbooks of liberal democratically situated ideal theory do not capture the lived realities of those who do not reside in electoral democracies... and that arguing *against* ill-advised episodes of contentious politics required cognisance of tenets of political sociology and international relations.\n\nThanks, Jonathan!",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 36,
      "content": "Pleased to report that the Paris temperatures have finally come down by a notch or two - hitting a comfortable 31 Celsius. Perfect for an evening stroll!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQFKTl4f2O0Pjw/feedshare-shrink_800/B56ZfLzeEdG0Ag-/0/1751471776505?e=1757548800&v=beta&t=8YiBqpUfbF5P81WCgAwtJLMCcsmhGSXN8ph9Ohz6AYw"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 37,
      "content": "Always a pleasure to be back in the 7th arrondisement, strolling along a very imposing piece of architecture. The sweltering heat (40 celsius earlier today) is thus made much more bearable by the aesthetics on display. Yet 'tis really not the best weather if you're feeling under the weather.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQGQ1ITUNWP-tA/feedshare-shrink_800/B56ZfHAjRfGoAg-/0/1751398221525?e=1757548800&v=beta&t=KQF4hK_heMAjlUOdfkyAwZCZkjQTf8GW2cZrLj6uo6Q"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 38,
      "content": "A personal note as to why I penned my Routledge book, Moral Debt: Defending A New Account of Reparative Justice, officially coming out today. \n\n\n\n\"Then the war came. First came aerial bombings. Then rationing. And then came the marching soldiers. At the tender age of eight, Grandmother lost her father. Her grief-stricken mother went blind. Her ailing mother begged their neighbours to raise her – a through-and-through city girl – in the rural New Territories. The three years and eight months of Japanese occupation of Hong Kong killed tens of thousands of civilians, with many more subjected to excruciating torture, mutilation, and abuse. Grandmother survived. Some of her extended family members, however, were less fortunate.\n\nWhile she remained deeply bitter about the events that befell her family during the war, she would remind me that we cannot “lump people together as one” – and take an unduly homogenising view about perpetrators of historical injustices. Not all Japanese are akin to those who tore her family apart.\n\nBoth of my parents were born two decades after the end of the war. They enrolled into high school, then university under the post-war British colonial government, which placed a significant emphasis upon education as a means of social mobility and fostering a highly equipped and competitive workforce. In some ways, they were beneficiaries of Governor Murray MacLehose’s emphatic focus on making education more accessible, affordable, and universally respected for colonial subjects. As Hong Kong’s longest-serving governor, who took office in the aftermath of the 1967 riots, MacLehose implemented sizeable socioeconomic reforms, tackled corruption, and smoothened relations between the colonial centre and the periphery. He brought real reforms to an atavistic system.\n\nWhen MacLehose left office in 1982, talks were well underway between the Chinese and British over the reversion of Hong Kong’s sovereignty to China – which framed the Opium Wars, and the original conditions under which the late Qing Empire had ceded its control over Hong Kong, as an ignominious episode in the country’s \"Century of Humiliation\". Anti-colonial antipathy aside, the reformist Chinese leader Deng Xiaoping saw many virtues in the British legacy in Hong Kong – the common law-based rule of law, internationally connected and open economy, and governmental transparency and accountability. He pragmatically envisioned 'One Country, Two Systems' as the basis for how Hong Kong was to be governed.\"\n\nStudying historical injustice is hence a deeply personal exercise for me.\n\nI am blessed to have received endorsements from Professors Amitav Acharya, Christine Loh, Daniel Butt, Erik Solheim, and Jeffrey Sachs. I look forward to hearing your comments and thoughts on Moral Debt (2025) -- and debating the intricacies of this deeply contemporarily germane issue.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQEruMn9tDfYpA/feedshare-shrink_800/B56ZfEfuQBG0Ag-/0/1751348340948?e=1757548800&v=beta&t=WeD41TVmP6JqZpjOwGdo2D22guVFlpmWApZmENXYTnM"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 39,
      "content": "Spoke to Dewey Sim at the South China Morning Post SCMP on the implications of the recent Iran-Israel war on Sino-US dynamics:\n\n\"On the sidelines of the World Economic Forum meeting in Tianjin, Brian Wong, Fellow at the, University of Hong Kong (HKU), said China would have “struggled significantly” in the short to medium term if global crude prices had risen due to serious escalation in the conflict.\n\nWong said that, despite the unpredictability of the Trump administration, Beijing was “not ready and is not able to step up as a genuine peace broker and a mediator in the region”.\n\nHe observes that Beijing does not have the knowledge and understanding of the cultural idiosyncrasies and intricacies of conflicts in the Middle East. Additionally, “Beijing doesn’t want to get its hands dirty,” he added.\n\n“It feels that the moment it assumes responsibilities to mediate and the moment that mediation falls through, its credibility would get irrevocably damaged. This is not something risk-averse foreign policy decision makers in Beijing want to see today.”\n\n“Yet in the long term, China would feel rather glad – and at the very least takes partial solace in the fact that – the US of today is by no means the US of yesteryear. The US had been a powerful actor that’s capable of truly leveraging both diplomatic and also coercive tactics in driving forward an economic agenda in a region like the Middle East – which would have systematically excluded China’s rising role to play in it.”\n\nWong said past administrations had been able to position the US as a stable and reliable provider of security to the Arab States, behaving in ways that would also act broadly in line with international expectations. Yet Trump’s unilateralist actions involving Iran had “completely undone that sort of uncertainty and predictability”, he said.\n\n“Given the unpredictability here, I would say that China is a long-term beneficiary from the American retreat from stable and consistent leadership.”\n\nWhile Trump’s attack on Iran showed that he was not hesitant to deploy force in regional conflicts, Wong said it also reflected his reluctance to fight a long and protracted war. But that did not mean China would see it as a chance to act to further its own interests.\n\n“China views this as a sign of the limits to American interventionism under Trump, that there are limits to what Trump is willing to invest and commit to hot zones. He’s unwilling to put troops on the ground, unwilling to get drawn out into protracted warfare, and unable to stick to a consistent line that’s going to last for any more than two to three days.\"\n\n“These are all messages that Beijing is picking up, but I don’t think this therefore means that Beijing feels thus emboldened to make a sudden move on ‘disputed’ territories, given the significant downsides of unilateral action.\" We should not read too much into American foreign policy for a glimpse into Chinese strategic thinking.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 40,
      "content": "Enjoying a two-day retreat in the City of Eternal Spring, Kunming - the provincial capital of Yunnan, the most bio- and culturally diverse province in China, which shares a border with Tibet, Guangxi, Guizhou, Sichuan (in China), and Laos, Myanmar, and Vietnam. Lovely to take some time off after an incessant travel spree, to speak with and guide excellent entrepreneurs who are eager to wrap their heads around the trying times in which we find ourselves.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQE0DU6nJihIqw/feedshare-shrink_800/B56Ze0zhkRGQAg-/0/1751085102533?e=1757548800&v=beta&t=ht-gDaKjb3LRsASxIRHw4KO6uMQKAOm9FOPuQcRZ1_Q"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 41,
      "content": "Always a pleasure to speak with my learned friend Djoomart Otorbaev, former Prime Minister of the Kyrgyz Republic. For the Oxford Global Society, we had a fantastic discussion about the following:\n\n- What makes Central Asia a geopolitically interesting and salient region? Why should we care about its growth and transformations?\n\n- Can the foreign policy strategy of multi-vectoral multi-alignment hold given the war unfolding in Ukraine, the West-Russia rupture, the tendentious and nuanced Sino-Russian tango in the region, as well as concerns over regional integration?\n\n- Corruption, rollback to civil and political liberties, and dearth of transparency - these are common objections and criticisms often levied towards Central Asian states. How valid and substantive are these complaints, and how should they be properly addressed within feasibility limits?\n\n- What is the past, present, and future of Sino-Central Asian relations, especially in light of the ongoing China-Central Asia summit in Kazakhstan? Where lies the future of Chinese presence in the region - especially with regards to transport interconnectivity and infrastructural developments?\n\n- Is technocracy in vogue now in the region? How does Djoomart, as a long-standing technocrat, navigate challenges and predicaments coming from all directions of travel, given the increasing politicisation of governance in the region?\n\nIt was a lot of fun conversing with Djoomart - kind, compassionate, and diplomatic (whilst honest). It was equally fun to be putting together this podcast after a (very) long flight back from London. Good to be back home in Hong Kong, albeit only very briefly.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQG7_4Zn-EippQ/feedshare-shrink_800/B56Zd4ixOsHoAg-/0/1750074071639?e=1757548800&v=beta&t=kGOcK8uv9EBA1CgS6RlRK8o3iLk-R8Rxmy23btm8bZ4"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 42,
      "content": "It was a true privilege and pleasure to have been invited by the inimitable BBC to partake in the flagship World Service Debate, on the topic \"Is Donald Trump making the world safer or more dangerous?\"\n\nThe panel was moderated by the exceptional, BBC Presenter and Chief International Correspondent, featuring:\n\nK.T. McFarland, former Deputy National Security Advisor to US President Donald Trump during his first term,\n\n, former National Security Adviser to the UK Prime Minister and Former Permanent Representative to the United Nations,\n\n, journalist and Associate Professor at the New York University\n\nThe discussion was invigorating, candid, and buoyed by a highly enthusiastic and involved audience. In conversations about the international order, there is a tendency to omit voices from the proverbial Global South, whose interests and preferences are construed as homogenous and less-than-significant. I must applaud BBC for seeking to tackle this problem by bringing me in, as someone who works extensively in ASEAN, Central Asia, and select parts of Latin America.\n\n1. The ongoing war in Iran-Israel is deeply alarming. Whilst all parties would benefit from off-ramping and de-escalation, domestic political incentives point to escalation. Reformists in Tehran (flanked by Pezeshkian) have lost considerable credibility over the past 9 months, whilst hard-liners are likely taking over subsequent to the decimation of the present military leadership. There is also a clear risk that the interests of the Israeli people have been held hostage by political calculus that does not do true justice to causes of stymying regional terrorism and attaining peace.\n\n2. Trump and MAGA supporters often argue that the US has been \"ripped off\" by other countries in virtue of gigantic trade deficits and asymmetrical defence spending. Whilst such complaints are understandable, they conveniently ignore the exorbitant privilege that comes with such phenomena - the hegemonic status of the USD as a tool of economic coercion and statecraft, gargantuan service net exports, and, of course, the flourishing of the military-industrial complex. The disillusioned working classes should take issue with the distributive structures undergirding the American political economy, not other countries.\n\n3. China is an emerging, \"learning\" power; it lacks the wherewithal - and indeed self-interest-anchored intention - to become a \"globally dominant power\". The US has 700+ military bases across the world; China has 1. The US has been enmeshed - rightly or wrongly - in at least one war per year on average since the end of WW2, China's last major war was in 1979, when it fought (and reached a stalemate) with Vietnam. Let us not construe China as six feet tall, and ignore the many other rising competitors, e.g. India and ASEAN, in this new geopolitical order.\n\nA link (free, though registration needed) can be found here:",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQGxj6Ffp_Lxuw/feedshare-shrink_800/B56ZduOzJLHoAg-/0/1749901069688?e=1757548800&v=beta&t=nD76FZAj5nKtkroND0EGloaUkEf4KoAJlzOpudXibrY"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 43,
      "content": "A real pleasure and honour to coauthor for Project Syndicate alongside my friend, Djoomart Otorbaev, former Prime Minister of Kyrgyzstan. We discuss the new Central Asian Playbook, which comprises a “three arrow” governance framework [of] \"institutional reforms, strategic “multi-alignment,” and regional integration\":\n\n//The first arrow reflects the region’s shift toward more technocratic leadership. In Kazakhstan, President Kassym-Jomart Tokayev, a veteran diplomat and technocrat, succeeded Nursultan Nazarbayev, who ruled the country for nearly three decades, in 2019. While Tokayev wisely shows respect for Nazarbayev, he has done much to transform Nazarbayev’s sclerotic system. This has included writing off bad loans held by one-sixth of Kazakhs – a bold resolution to a problem that had repeatedly forced bail-outs – and sharply increasing infrastructural spending.\n\nBeyond senior leadership, a new class of technocrats and experts from the public sector, businesses, and NGOs has gained influence in Central Asia. In Kazakhstan and Kyrgyzstan, in particular, young, tech-savvy figures have assumed key decision-making positions, including in their countries’ cabinets. Private-sector players – including those representing small- and medium-size enterprises – have also had their voices heard, bolstered by stronger property rights.\n\nThe second arrow – a multi-aligned foreign policy – entails the diversification of trade and strategic partnerships. Though they are not turning their backs on Russia, Central Asian states are now embracing new opportunities to increase their economic resilience (especially against supply-chain shocks and commodity-price fluctuations) and raise international profiles (and thus bargaining power).\n\nThe EU is actively seeking to expand its regional footprint in response to the Ukraine war, and Arab countries, especially in the Gulf, see fertile ground for mutually beneficial partnerships with Central Asian countries. China, for its part, has emerged as a renewable-energy powerhouse and major source of investment in infrastructure. This is particularly relevant for Kazakhstan, Kyrgyzstan, and Tajikistan, which share a border with China – Kyrgyzstan’s largest investor last year, accounting for 23.9% of total foreign direct investment, which edged out Russia’s 22.7% share.\n\nThe third arrow – deeper regional engagement – includes the removal of barriers to trade and talent flows, as well as business activities and other commercial exchanges. This process received a major boost following the normalization of Uzbekistan’s relations with other Central Asian economies (and Turkey) in 2016. Intra-regional trade turnover surged by 80% between 2018 and 2023, reaching $11 billion, thanks largely to the strengthening of transport networks, such as railway links.//",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 44,
      "content": "Nothing beats a tranquil afternoon spent in one of my favourite book stores in Southeast Asia, Kinokuniya at Siam Paragon. Whilst a very hectic schedule rendered an overtly long stay unfortunately impossible, it was great to drop in - and out - for a quick tour before my outbound flight. Sawasdee, Bangkok!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQE5eLR-Chz7ug/feedshare-shrink_800/B56ZdjhT05G0Ao-/0/1749721368643?e=1757548800&v=beta&t=tIDVngE0voqnOQF5cADIsG2gAMdOt8OgFQNRzInbD9E"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 45,
      "content": "Enjoyed speaking with CNBC-TV18, in which I shared my views on why China is open to lifting all export restrictions to the US... provided Washington exhibits a level of consistency and commitment to promises that are frankly lacking at present.\n\nNo Deal with Trump is ever done, or final. Change is part and parcel of the \"Art\" of the \"Deal\".\n\nTalk of a Grand Bargain is premature - the London talks were merely a momentary ceasefire with a tad more teeth than Geneva (H. Lutnick's involvement suggests that Trump wasn't happy with a purely technocratic line-up; Beijing had Politburo member and confidante-to-leader He Lifeng flanked by two minister-level and seasoned vice-minister-level aides for this operation). Trump and Xi have yet to properly sign off on the \"agreement\". Expect flip flops over the coming weeks.\n\nThe tariffs are going to hurt China in the short run. Caixin PMI points to worrying confidence crunch amongst SMEs. GS estimates from two months ago had 50% tariffs rates inducing a -1.5% drag on GDP; if 100%, an extra -0.9% should be added. Diversification to alternative markets is necessary but takes time, and China must deal with escalating backlash in the European Union and even ASEAN.\n\nWith that said, there are signs that the government is taking seriously the writing on the wall. Pragmatic technocrats have been forcefully communicating the case for China to improve worker wages, strengthen social safety net, significantly ramp up policy transparency and consistency, crack down upon overzealous local officials and reform centre-periphery fiscal arrangements, so as generate the berth and ground for long overdue reforms.\n\nI closed by mentioning Prof. Kishore Mahbubani 's proposal of a \"CIA\" world: a world shaped and driven extensively by the combination of China, India, and ASEAN, collectively comprising 3.6 billion people: over 40% of Planet Earth's population. The future of the world can and will loom bright once countries recognise a) there need not be a dominant pole and b) small and medium powers deserve to have their rights and interests respected, whether it through regional consolidation or minilateralist institutions.\n\nFundamentally, the primary \"fight\" of our generation will play out between multilateralists and unilateralists, as opposed to autocrats and democrats (and mixed regimes in between), or the ascendant Global South and the struggling but persistently enduring Global North. Expect an American foreign policy that will become increasingly nationalistic, myopic interest-driven, and frustrating for all long-standing partners who gave up immense volumes in exchange for supporting a relatively stable geopolitical order that is now past its expiration date. Europe must rise as an alternative flag bearer of democratic and liberal values, at an age where basic global decency should and can still matter.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQEBRLpnhMgwzA/feedshare-shrink_800/B56ZdjKxxZGsAg-/0/1749715461940?e=1757548800&v=beta&t=OaByeVjZ4YdJ4P6rCV6vROyzwmugtVTBsqmJ8vLCovk"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 46,
      "content": "As a part of my job at a wonderfully supportive and intellectually ambitious university, and in relation to my research portfolio, I have the opportunity and pleasure of visiting some truly fascinating places. Travelling, as with most good things in life, is a double-edged sword.\n\nTravelling is uniquely rewarding for those stricken with wanderlust, a feisty child-like fervour that overwhelms one with trepidation turned exhilaration. We like to think that we travel in search of bliss, meaning, and value. In practice, we travel often with a much clearer sense of mission but a much reduced sense of purpose: we travel for work, for labour, for making ends meet. The luxury to travel to wherever one seeks, for whatever ends one yearns, is not one afforded to many - especially as they age (in the run up to their retirement).\n\nYet travelling can also be deeply disorienting, discombobulating, and thus disconfiguring. A fellow philosopher who advised a prominent fashion house once said to me over a Shanghainese lunch, that air travel is an innately violent exercise - the plane plucks one out of a location and sends one into another, as if it were a protracted teleportation machine. Whilst I begged to differ with his view of violence, there is something to be said about the contemporary practice of carefully curated hyper-mobility - gate-kept by a narrow class of individuals who find themselves both beneficiaries and victims of a system that demands their presence, everywhere, anywhere, all at once.\n\nUltimately, travelling is paradoxical: we are encouraged to make our home beyond homes; to seek solace amidst the constancy of transient movements; to strive towards the Aristotelian ideal of friendship whilst settling for the few Whatsapp messages or emails that serve as mutual reminders of the occasional social contact; to explore the world by narrating it through fixed frames of reference -- landing, takeoff, start-end times, buffers...\n\nTravelling is most rewarding when it empowers us to conquer the unknown with our feet, hearts, and minds. Panic is how we feel when the inclement wearher renders us on the cusp of missing our fights. Ennui is the word we use for the pauses with baited breath and preludes to trips, as well as the dreary denouement of journeys coming to an end. Discombobulation is the word we use to describe the constantly in-flux limbo state in between timezones that are 13 hours above... Yet when panic, ennui, and discombobulation come together, we thus arrive at the unique cauldron-cum-secret recipe that makes travelling a joy.\n\nFor ultimately, it's the people who matter: the friends you make on the way, the conversations you strike with strangers in not-so-strange social settings, and the ability to leave behind parts of your constructed social self as you travel, almost like you are forgetting in part, to embrace an old friend that has yet to greet you.\n\nWhat a wonderful (albeit stormy) evening out over the Mekong River in Luang Prabang!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQFAasN9nZ9R0Q/feedshare-shrink_800/B56ZdfLT83HUAo-/0/1749648503305?e=1757548800&v=beta&t=UEgTwtAUoOl6lr8ITYslNYYJBcr2fogeOK_32JPHZGc"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 47,
      "content": "Taken en route from Vientiane to Luang Prabang. Have to say, the Boten–Vientiane high-speed railway is pretty impressive. Staring out the windows at the Laotian countryside, with its many mountain hills and lush greenery, meandering rivers and abundance of trees, reminds me of a journey that I took from Hong Kong to Kunming, just a few weeks ago...",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQEOXG6GttEHPA/feedshare-shrink_800/B56ZdeJR5ZHEAg-/0/1749631233456?e=1757548800&v=beta&t=X4U2L0FgE0u9asiwbOfBClWzI8p4-vbfgQkjYzeDEUo"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 48,
      "content": "A delight to be in Vientiane, the Laotian capital city right on its border with Thailand. Photo was taken at Patuxai, a war monument built between 1957 and 1968, dedicated to lives lost in the struggle for independence from France.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQHM8vDtJweBtw/feedshare-shrink_800/B56ZdY7CN7H8Ag-/0/1749543567600?e=1757548800&v=beta&t=Y_pwkXxlbte0J1ajh2Inp7644rUSI6qxrLWB1SKBKrs"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 49,
      "content": "Studying authoritarianism is part and parcel of my academic portfolio. For the South China Morning Post SCMP, I argue:\n\n\"What is the fundamental contradiction shaping our world today? Some may say it’s the dichotomy between democracy and autocracy – a staple in the previous administration.\n\nBiden’s successor, Donald Trump, is well known for being transactional. Last month he said Washington would lift sanctions on Syria, although the country’s new government hasn’t exactly put it on the path to democracy. Syrian President Ahmed al-Sharaa has pitched a slew of positive perks, including a Trump Tower in Damascus.\n\nMeanwhile, the United States’ squeeze on academic freedoms – as evidenced by threats to revoke visas for Chinese students and international students harbouring divergent views – speaks volumes of a dystopian new normal.\n\nAn alternative reading would suggest that our times are marked by a struggle between the Global North and South.\n\nYet this view ignores the existence of clear schisms within the latter. For instance, neighbours India and China have a fraught relationship, despite positioning themselves as leaders among emerging powers. The ISEAS-Yusof Ishak Institute’s 2025 State of Southeast Asia Survey found that trust in the US has increased among policy elites in ASEAN member states despite Trump’s return. South China Sea tensions were the top geopolitical problem for 51.6 per cent of those surveyed.\n\nA far more crucial distinction lies in the struggle between unilateralists and multilateralists. Unilateralists are clearly on the rise in the post-industrial West. In Britain, Trump’s kindred spirit Nigel Farage used similarly virulent, xenophobic rhetoric rooted in populism to achieve a remarkable groundswell in support, attracting voters disillusioned with the country’s mainstream parties. While banned from competing in the next presidential election, Marine Le Pen remains popular among French voters who perceive the leadership in Paris as insufficiently “pro-French”.\n\nWhat unites these individuals is not so much a coherent ideology or positive vision but a repudiation of what their countries have purportedly become. They declare that globalisation has done their countries more harm than good, that international rules and norms have been misappropriated by a global elite to deprive the people and that immigration must be stopped.\n\nSuch unilateral sentiments cut across political systems. Russian President Vladimir Putin’s invasion of Ukraine reflects a cynical contempt for international norms such as sovereignty. Trump prides himself on having a robust personal relationship with Putin, who he has praised for being a “smart” and “strong leader”.\n\nOne can only hope China draws the right lesson from the current turmoil embroiling the US – that unilateralist geostrategic adventurism comes at a hefty price; that pacifist multilateralism can and must remain the path forward. Peace is worthy of defending, even if its antithesis is tempting.\"",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    },
    {
      "post_number": 50,
      "content": "Always a delight to be stuck in Bangkok traffic. Feels like half of the business deals are struck and one third of important decisions are made in the brilliant gridlock... filled with life, angst, and pregnant expectation of the hectic. What a remarkable city!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQEju2UC20vQcA/feedshare-shrink_800/B56ZdUMkKxGQAk-/0/1749464277992?e=1757548800&v=beta&t=L2Gk-4CQYI8nRuPiaoIxljwx4VPwinlpnv65GOdO5oA"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/brian-wong-26060b8a/"
    }
  ]
}