{
  "session_id": "20250808_221718",
  "timestamp": "2025-08-08T22:17:52.239473",
  "profiles_scraped": [
    "https://www.linkedin.com/in/mike-marinaro-medtech/"
  ],
  "total_posts": 49,
  "posts": [
    {
      "post_number": 1,
      "content": "I recently returned from Japan where we celebrated 50 years of Medtronic improving patient lives in one of our most important markets. \n\nI enjoyed spending time with our Japan Acute Care & Monitoring, Endoscopy, and Surgical teams – recognizing top performers, discussing our strategy, and connecting in person. I also appreciated the chance to meet with customers and hear how we can continue strengthening our partnerships.\n\nAnother highlight was joining more than 2,000 Medtronic Japan employees for a special anniversary celebration and Mission & Medallion Ceremony. It was a great reminder of our purpose.\n\nThank you to the Medtronic Japan team for your hospitality and unwavering focus on our customers and the patients we serve.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQH6RNWUVEw4Tw/feedshare-shrink_800/B4EZhcKpRaGoAk-/0/1753892953211?e=1757548800&v=beta&t=boHhFGbB0C7_h0UoeR-YwdBZaFx-KQgy__gdRCrVEYk",
        "https://media.licdn.com/dms/image/v2/D4E22AQHaplBo_Fk6IA/feedshare-shrink_2048_1536/B4EZhcKpJbGUAs-/0/1753892951855?e=1757548800&v=beta&t=fQAO_v4AkarNHiAYAJqSuR-ApdJSn2pdL2IOrBD42JA",
        "https://media.licdn.com/dms/image/v2/D4E22AQG1T5kvG0ELfQ/feedshare-shrink_2048_1536/B4EZhcKpOLGoAs-/0/1753892951828?e=1757548800&v=beta&t=5fiKy73sZn_1MpHejJPDO3ntLDY-EUVUWNZSqgntEsk",
        "https://media.licdn.com/dms/image/v2/D4E22AQGSx2lNMYRyGQ/feedshare-shrink_800/B4EZhcKpNiGcAg-/0/1753892951732?e=1757548800&v=beta&t=rhbARrOHhqcq1-XGH1ThASoqSZKW7DcARts7aABPjLQ"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 2,
      "content": "One of the most important things we can do as leaders is truly listen to our customers. \n\nLast week, my extended leadership team and I invited, Chief Supply Chain Officer at, to speak with us and share her perspective on collaborating with. With more than 30 years of experience across nearly every aspect of healthcare, Meena brought a valuable and honest perspective to our conversation.\n\nWe talked about how Medtronic is showing up today and where we could partner more. We also discussed the pressures health systems are facing right now and what it takes to be a truly effective partner in this environment.\nI love conversations like this because they keep us grounded. They give us insight into what our customers need and how we can solve problems together and deliver better care to patients.\n\nThanks again to Meena for the great discussion – and tofor the introductions and to our Medtronic teams who partner with our customers every day to support patients around the world.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQFK9ajTuA5N9A/feedshare-shrink_800/B4EZgO4skbGYAg-/0/1752596400799?e=1757548800&v=beta&t=C1jWRsmClS7M8ZIZhdDi_1c6Snsv51c5bJj6PxWrd-I"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 3,
      "content": "I’ve always believed the best work is driven by purpose, and our Mission makes ours clear: to alleviate pain, restore health, and extend life. \n\nThat kind of impact takes more than technical excellence. It takes collaboration, curiosity, and the ability to value the experiences and perspectives of every employee.\n\nThat's why I was grateful for the opportunity to speak at the first-ever Medtronic We Summit last week, a global event dedicated to fostering connection, inclusion, and innovation.\n\nThe conversations, ideas, and energy from across the organization were inspiring. They underscored that when people feel heard and trusted to contribute, we move faster, make better decisions, and ultimately do better for those who count on us most: the patients we serve.\n\nI was fortunate to share the stage with leaders likeand, who lead with purpose and make a lasting impact every day.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQFCs0ndTKphLw/feedshare-shrink_800/B4EZgO2tISHoAg-/0/1752595884662?e=1757548800&v=beta&t=iqSRcN2m_iF_xKk7xGNwzbKKow-jbvAN3ysRVI7flX4"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 4,
      "content": "I am excited to share that Kate Benedict, CPA, MBA joined Medtronic as president of Medtronic Acute Care & Monitoring. Her people-first, patient-centric leadership style and deep experience across the industry make her uniquely suited to lead ACM as we continue to empower healthcare professionals with world-class technology to personalize patient care, anytime, anywhere. Welcome, Kate!\n\nRead more about today’s news:",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 5,
      "content": "Our careers rarely follow a straight path. Success often requires balancing thoughtful planning with the ability to adapt to change and unexpected challenges along the way. Sometimes, it’s in those unexpected moments that our true character shines through.\n\nis a great example of that. Her journey — recently featured by Boston College — shows the resilience, leadership, and character that inspire all of us at.\n\nMeredith, we’re grateful for your many contributions and proud to have you on our team — and as a fellow Eagle representingwith such excellence.",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/07f827d5-88a4-4a9e-bbc1-79a8b69ce4d8"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 6,
      "content": "In the heart of Boston, more than 300 brilliant minds are pushing boundaries within 100,000 square feet of research and development space. These talented software and mechanical engineers are at the forefront of innovation and part of our soft-tissueteam.\n\nI was honored to share our progress with, Secretary of Health and Human Services, and Interim Secretary of Economic Developmentlast week. Building these important relationships is crucial in helping us attract and retain exceptional talent.\n\nThe Medtronic Hugo™ RAS system is commercially available in certain geographies. Regulatory requirements of individual countries and regions will determine approval, clearance, or market availability. In the U.S., the Hugo™ system is an investigational device not for sale.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQFv3CSPMi7I8A/feedshare-shrink_800/B4EZasv30yHoAo-/0/1746654954456?e=1757548800&v=beta&t=CfOb5x6bE42jvMbRUgkCjZ1EiSsiIRAJ6HRD5i7mjG4",
        "https://media.licdn.com/dms/image/v2/D4E22AQHrLDBWYmwWJw/feedshare-shrink_800/B4EZasv30vGcAk-/0/1746654954053?e=1757548800&v=beta&t=Czx9ZWQcTyDYUrlpy3TRxjDUkzdNu0KxQvBCfJPlUy0",
        "https://media.licdn.com/dms/image/v2/D4E22AQGtd0e4vZI_EA/feedshare-shrink_800/B4EZasv30vGcCA-/0/1746654954019?e=1757548800&v=beta&t=hb-FEYJNozqUVj2CrLwi4qyhj3QMUFHBxy7pp39d1AY",
        "https://media.licdn.com/dms/image/v2/D4E22AQFmSnlfFSBGvg/feedshare-shrink_800/B4EZasv34HGYAk-/0/1746654954791?e=1757548800&v=beta&t=_ZKhnPCyjSK69ttCwaJ-Yf41qal7DQyCpbHlPOYqIuA"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 7,
      "content": "Bedside stapling in robotic bariatric procedures associated with improved outcomes and reduced costs. Check out the robust data published by Drs. Helmuth Billy, Benjamin Clapp, Rami Lutfi and Elaine P.. \nhashtag",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 8,
      "content": "As athletes and physicians push the boundaries of human performance, technology stands as a powerful ally.\n\nMy latestTech Council op-ed explores the innovative role of digital technology in pushing both athletes and surgeons to peak performance. Here’s a quick look at the three key areas where tech is making a real impact:\n\n🎯 Data & Intelligence: Just as Paralympic and Olympic teams use data to hone every aspect of performance, surgeons are leveraging data insights to reduce errors and refine their skills. From analysing surgical videos to using AI-powered tools, these insights promise a new level of precision.\n\n🤝 Training & Coaching: Digital tools enable more personalised coaching and development — vital in both sports and surgery. Just as coaches guide gymnasts through complex moves, surgeons can review their own techniques in detail, using AI and digital simulations.\n\n🌐 Connectivity: While athletes train with coaches in real time, surgeons often operate alone. Today’s technology bridges this gap, enabling real-time support and collaboration from peers worldwide, and offering insights that can enhance patient care.\n\nFor our healthcare leaders, there’s a pressing opportunity to adopt these advancements - bringing the same precision that wins trophies into the operating room.\n\nCheck out the full article here:",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 9,
      "content": "👁 Are you interested in embracing new technologies in your OR? \n\nWant to learn more about Touch Surgery™ Live Stream?",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/052a5010-8a3a-471a-9c17-cb1c9217106e"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 10,
      "content": "For 75 years, Medtronic has unlocked the incredible partnership between physicians, technology, and people. As the pioneers in MedTech, we solve some of the greatest healthcare challenges in our pursuit to \nhashtag\n,\n, and\n.\n\nI am fortunate to work for a company with such a deep\nguiding our ideas and decisions each day. It is a great honor to share our history, purpose, and future with colleagues through our\nceremonies – and I recently had the honor of leading one with our team in London.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQGNePPtGdPz-w/feedshare-shrink_800/feedshare-shrink_800/0/1727703271172?e=1757548800&v=beta&t=O5yjtfKbDjf3-h6bvmEJb0is8X_7Hz7KTm_L2XItnjc",
        "https://media.licdn.com/dms/image/v2/D4E22AQH7vMiggxoGkg/feedshare-shrink_800/feedshare-shrink_800/0/1727703270474?e=1757548800&v=beta&t=SLFKaux-tjVhd2xPUxhaaTeq89gXjKw1x1Uqd7cn-eo"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 11,
      "content": "Medtronic’s Hugo represents more than just a new surgical tool; it symbolizes a broader shift towards a future where artificial intelligence, robotics, and human expertise collaborate to deliver unprecedented levels of care. As we look ahead, the challenge and opportunity lie in bridging the gap between technological innovation and medical practice—a venture that will shape the future of healthcare for generations to come.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 12,
      "content": "We celebrated our \nhashtag\n#75th anniversary with the ringing of the \nhashtag\n#NewYorkStockExchange bell! A celebration of the dedication and hard work of our amazing team alongside healthcare providers and partners around the world.\n\nStanding on the iconic platform was a moment of reflection – on our leadership across what we do and on the opportunities in front of us. Together, we impact the lives of two patients every second through our\nand I look forward to what we will accomplish next.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQEMobV4FJnHsQ/feedshare-shrink_800/feedshare-shrink_800/0/1725974981928?e=1757548800&v=beta&t=XoM70rMcVs8F8yUC3MlRJcq_UKBIxpmtFIXVJ_-WfWA",
        "https://media.licdn.com/dms/image/v2/D4E22AQHIoSYF5zZNEw/feedshare-shrink_800/feedshare-shrink_800/0/1725974982044?e=1757548800&v=beta&t=aLJ6qkIEEe2NDL8FE_EgM1Rpb5Dqh7BOixTFoCSOnIk"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 13,
      "content": "🌎 The first adopters of Touch Surgery™ Live Stream are officially underway in their practice. \n\nThis week, bariatric surgeon,, at Transform Surgery in Washington state invited attendees including fellow bariatric surgeons across the US along with Medtronic colleagues to join his first case via Live Stream. Dr. Billing says \"Touch Surgery™ will bring surgeons together from around the world to share techniques and novel procedures.\"\n\nIn Europe, robotic surgeon, \"acquire[d] the TS streaming platform that will allow us to broadcast live anonymized surgery with bidirectional connection with external supports (mobiles, tablets, computers,...) which will improve the training of our students, the proctorization of new users and share experiences with other colleagues interested in the world of robotics.\"\n\nWant to learn more?",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQGkQ-3CioQJVA/feedshare-shrink_800/feedshare-shrink_800/0/1724427165835?e=1757548800&v=beta&t=dkRckMeFSZ3G-o8mlqRyWrvuKZYIo48kYf8k5q-ID6w"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 14,
      "content": "The Medtronic Digital Technologies team celebrated a huge milestone this month with the commercialization of Touch Surgery™ Live Stream and Performance Insights! \n\nTeammates gathered in the London office for a well deserved launch party celebration to mark this moment.\n\nThank you to this incredible team; your passion and dedication is inspiring.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQH8Ir8ega28mA/feedshare-shrink_800/feedshare-shrink_800/0/1723035755659?e=1757548800&v=beta&t=azf5yhgQ3hX-rybb8QZ1HVeOJBaVRkEGh9nvK2XbYIc",
        "https://media.licdn.com/dms/image/v2/D4E22AQHwWMclamZsbg/feedshare-shrink_800/feedshare-shrink_800/0/1723035755492?e=1757548800&v=beta&t=SrghIt43l4VJsEuEfeipnzlHBl8Hx9ahIWkZvqX5wR0"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 15,
      "content": "What a Memorable Week (2/2) \n(Link to Episode 1/2 😁: https://lnkd.in/dp_rBy3J) \n\n🎥 Hugo™ RAS goes live with Live Stream!\n\n1️⃣ For the first time, we used a proprietary live streaming technology to broadcast surgeries internationally, thanks to the Touch Surgery™ Live Stream (Website:) platform.\n\n🤳Being in the operating room during the live was an incredibly exciting moment. Using this system for live broadcasts and virtual clinical coaching sessions opens new pathways in medical education.\n\n🙏 We appreciate the efforts of Prof.(LinkedIn Post:), the Director of the Robotic Surgery Program at Centro Hospitalar Universitário de Santo António, Prof. Rosa Zulmira, director of the gynaecology unit, Prof.and team (LinkedIn Post:) who skillfully performed surgeries with Hugo™ RAS and believed in the potential of the Live Stream, and Dr.who supervised the docking operations.\n\nCongratulations to the entireteam for their hard work and innovation in making this possible and colleagues in and outside the OR.\n\n,,,,, Nicolas Villanueva,,,,,,,",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4D22AQH8TT9Q_Z03bw/feedshare-shrink_800/feedshare-shrink_800/0/1717944110541?e=1757548800&v=beta&t=lBmd0wpzP0FfljjavWBh8f0KnEQ92WGOnIikQUWyZg0",
        "https://media.licdn.com/dms/image/v2/D4D22AQEHH_Zd4RgI6w/feedshare-shrink_800/feedshare-shrink_800/0/1719031387536?e=1757548800&v=beta&t=Uk9Zb03MCWPqIlPlmoFGzzLzfuWwRVFho5moc7-gtjc",
        "https://media.licdn.com/dms/image/v2/D4D22AQGuVHVVwG0Olw/feedshare-shrink_800/feedshare-shrink_800/0/1719190361390?e=1757548800&v=beta&t=6kPXkENDsKZwJiCqAFhdcPJZ1r5d_6HetZleIlVWXrQ"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 16,
      "content": "🚨 The big day is here! We're happy to announce that Live Stream, the newest part of the Touch Surgery™ ecosystem is now commercially available in the US and WEU!\n\nTouch Surgery™ Live Stream is an easy-to use intraoperative coaching platform that integrates seamlessly with the Touch Surgery™ ecosystem.",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/16a167ea-9df1-4eb9-a76a-922cc91d633a"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 17,
      "content": "The U.S. healthcare system is under pressure. \n\n1 in 5 healthcare workers have left the profession since the pandemic, while financially stretched hospitals continue to navigate staff shortages and experience increases in patients who need care. This means time is precious — particularly for surgeons, and the high costs surrounding the OR.\n\nThe U.S. State of Surgery 2024 Report from, announced at, reveals U.S. surgeons are losing a month of work time every year due to outdated, inefficient tech.\n\nOf the 1,000 U.S. surgeons surveyed, 74% say inefficient technologies in the OR are impacting patient care. And, almost 2 in 3 report that they’ve considered leaving the profession due to burn out. While we must tackle these challenges together holistically, surgeons identified digital technologies as a way to unlock their time and, in turn, elevate patient care.\n\nWith that in mind and our\nat heart, we’re harnessing the power of people and technology to shape a better future. One where every patient has access to the best care, because their surgeon is empowered with efficient, connected and intelligent tech.\n\n🔗",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 18,
      "content": "Rajit Kamal of Medtronic is delivering a powerful presentation on the future of surgery in a joint keynote at DeviceTalks Boston and the Robotics Summit & Expo. \nhashtag\n#Standingroomonly \nhashtag",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQEEQ0FfQbzjcg/feedshare-shrink_800/feedshare-shrink_800/0/1714679652678?e=1757548800&v=beta&t=991ETHfk000fnLHE6I3UkFM3oRGiqTXhgsP7PJqALE0"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 19,
      "content": "We must always adapt to the ever changing world of work to ensure our employees have what they need to succeed. With that, we're proud to be recognized as one of LinkedIn's \nhashtag\n#TopCompanies for 2024. We're committed to encouraging our employees to grow, expand their skillsets, and prioritize their career progression.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 20,
      "content": "75 years of improving lives — and we're just getting started. As we celebrate our past, we are even more excited about our future. Here's to the extraordinary feats of engineering and life-changing impacts to come.",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/9455186c-3fec-46cf-b6bc-5067c445d51d"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 21,
      "content": "From humble beginnings in a Minneapolis garage to becoming the global leader in healthcare technology, the past 75 years of Medtronic have been nothing short of inspiring.\n\nOur co-founders’ keen foresight and relentless spirit of innovation continue to usher us forward as we redefine what's possible in healthcare. With two people every second benefiting from Medtronic technology, we're committed to ensuring that everyone, everywhere, has access to our life-changing innovations. Here’s to the next 75 years!",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 22,
      "content": "The Medtronic Endoscopy team's unwavering dedication to leading the AI transformation in GI care continues to impress me.\n\nLast month, at our Genius Summit, we unveiled how innovation and collaboration can advance the field of endoscopy but also, more importantly, make a real difference in the lives of patients and the healthcare professionals who serve them.\n\nColonPro™, our latest software update for GI Genius™, and our strategic collaboration withare paving the way for a truly exciting future where technology enhances every aspect of endoscopic care and pushes the boundaries of what’s possible.\n\nI’m excited to be part of this journey!",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 23,
      "content": "We are honored to introduce our newly approved Transorb™ self-gripping resorbable mesh. This week, Dr. Christopher Macomber completed the first case with the 30x30 cm size of Transorb™ mesh at Abbott Northwestern Hospital.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 25,
      "content": "Bringing technology into healthcare goes beyond innovation: it's about addressing a fundamental need. From offering remote access to coaching from top surgeons worldwide, to offering analytics that can create actionable change for more efficient surgeries through learning and education, the possibilities are vast.\n\nAnd so - we are proud to announce that Touch Surgery™ Ecosystem has expanded.\n\nWe’re revolutionizing remote training with newly launched Touch Surgery™ Live Stream, so surgeons will be able to showcase their work and research across the globe and close the gap in surgical training and innovation.\n\nAdditionally, Touch Surgery™ Performance Insights now hosts the largest available bundle of new AI surgical insights for post-operative analysis across laparoscopic, and robotic-assisted surgery.\n\nAt Medtronic, we’re focused on creating experiences that put patients first.\n\nThese innovations bring us a step forward.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 26,
      "content": "Paused business to admire the solar eclipse with the team in Boston – a moment to appreciate nature. \nhashtag\n#solareclipse2024 \nhashtag\n#medtronicemployee",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQE0bVJzGzgCfw/feedshare-shrink_800/feedshare-shrink_800/0/1712695245100?e=1757548800&v=beta&t=55Rdzzg_M0XFVtQtBeOBoaSPKMYB3iLXEiQrOSXtd38"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 27,
      "content": "Our March 2024 Issue is now LIVE!\nFeaturing on the cover, \"How Medtronic is using \nhashtag\n#AI\".\n\nAlso in this issue, you'll learn all about:\n-bets on balloons in the\nbattle\n- How’s robotic Galaxy system goes deep into the lungs\n- The biggest stories from2024\n-\ndon’t improve\nrevision rates, study says\n\nIf\nin\nstrikes your interest, you're going to want to check this out!\n\nDIVE IN!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQEZ5WLlllsLMQ/feedshare-shrink_2048_1536/feedshare-shrink_2048_1536/0/1709219453832?e=1757548800&v=beta&t=jqgs5-Q43zxiIpSP59n_anrd1f8P8RZfhIg5e6po3Do"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 28,
      "content": "Today, we announced another strong quarter that reflects continued momentum across the Medtronic enterprise. In Q3, we had strong growth in international markets and strength in several of our businesses, including Core Spine, Cardiac Surgery, Structural Heart, and Cardiac Pacing. At the same time, with a rapid cadence of new product approvals, we’re investing in our pipeline to expand access to innovative healthcare technologies around the world in robotics, AI, and closed loop systems.\n\nWe’re focusing our performance-based culture on execution, speed, and playing to win, and while there’s more work to be done, I am excited about our progress. Our people power all that we accomplish, and as always, I’m grateful to our teams who continue to work hard and advance our Mission to alleviate pain, restore health, and extend life.\n\nFor more on our results, read the press release:",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 29,
      "content": "Great read in Forbes from George Murgatroyd, highlighting the technological gaps surgeons are facing when reviewing the broader surgical picture. \n\nConnecting, analyzing, and informing the\nis essential in helping to make more informed decisions for better patient outcomes. This is the future of care and a capability we are uniquely positioned to deliver – activating the 50,000 operating rooms globally in which we play a critical role today.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 30,
      "content": "The future is exciting – especially because it’s now. \nhashtag\n#Digital capabilities in healthcare, including \nhashtag\n#AI, are playing an important role in shaping the future of care. \n\nIn our latest report, ‘State of Surgery in the UK: Technology and Efficiency in Patient Care’, we also uncovered technology’s importance in surgical\nand\n. Read the full report:",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 31,
      "content": "Joined Governor Ned Lamont on a visit to Medtronic in North Haven. Commissioner Designee Daniel O'Keefe, AdvanceCT's Tim Miller and Lisa Mercurio were given an overview of the products made in North Haven and the Governor and Commissioner operated the surgical robotic system.\n\nGreat to show the Governor the lifesaving technology and products being developed and manufactured here in Connecticut.\n\nThanks to the team at Medtronic -,,,,and others for a great tour and overview for the Governor.\n\nMake it here!",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQFB5A8fbPNTYw/feedshare-shrink_800/feedshare-shrink_800/0/1705106050763?e=1757548800&v=beta&t=B1vhKePWinweTA219WtaLkuXvaJBAWYB1BxVz0JZPGY"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 32,
      "content": "Thanks Jonathan Hatwell, Medtronic Robotic-Assisted Surgery for sharing my story. \nIt was an unbelievable experience, and I remember every part before and after the procedure itself.. but let's go back to the D-Day for a second. Entering the OR on my wheeled bed, I could see an installation mate smiling at me calm and relaxed. Another one (who I couldn't actually see) gently touched my head and then whispered me \"I'm here\".\nI feel these two moments will treasure my heart and memories forever.\nThanks Elisabetta Bajardi,,andfor being my guardian angels while I was on the table.\n\nAfter leaving the OR, I woke up in a different room and then was moved to another. I could have a selfie of the belly region to satisfy my curiosity. I could see a nice plot drawn with a marker, and 4 little patches: that made me smile spontaneously and ask myself: \"..did they fix it?\".\nShortly after, some pain came out and Dr. Gangemi visited me. both of these confirmed me: it was fixed! Pain couldn't prevent me to stand on my feet after less than 6 hours from being awake, look at the threes outside the window and people walking by in Bologna.\nAfter less than 24 hours I was getting my final medication and check from the hospital staff and I was free. Packed up my back-sack and got my baseball cap and I left the hospital heading home. I wanted to get home back to my family.\n\nI'd been looking for a taxi but I couldn't find one so I simply walked to the station.\nSlowly, I walked downtown, had a rewarding ice cream looking at the ancient towers.\nOnce I entered the main railway station I bought train tickets at a digital kiosk. Needed to change 3 trains before getting back. Walking out the station I finally called my loveand she came to pick me up mid way.\n\nI wish to thank everyone atwhere I saw highest professional skills with a remarkably consistent human touch everywhere with every patient.\nI wish to thank Dr.: I liked his mindset and approach at first sight during\ninstallation and loved his inspiring way of sharing his knowledge and vision with everyone. My appreciation of him as the surgeon curing me, although being totally unexpected, was even better and I appreciated his talent in explaining me and answer my curiosity on every detail.\n\nBeing a patient is not a good deal in everyone's life. I wish to express my deepest gratitude to each and every Medtronic employee for the unique way they put patients first, they celebrate patient centricity while protecting patient privacy at the same time.\nFeeling embraced by\nall along this\nturned out as an unforgettable moment of my life and build solid foundation to keep Medtronic's Mission at the core of all I do, always.",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/51c39f82-805e-4b87-b8de-eb57a86c117e"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 33,
      "content": "Earlier today, Medtronic reported another quarter of strong performance with revenue of $8.0 billion, which increased 5% organic. Our results are broad-based as we deliver on our commitments across multiple businesses and geographies.\n\nGuided by our Mission and powered by our people, we’re creating innovative products and therapies for millions of patients around the world, while also positioning ourselves for long-term sustainable growth.\n\nFor those of you celebrating Thanksgiving this week, I hope you enjoy a happy and safe holiday with loved ones.",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/137515ec-c9a6-410d-904a-c709e388bae0"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 34,
      "content": "In memory of Leon C. Hirsch, innovator, entrepreneur and founder of the US Surgical Corporation.\n\nFrom the first surgical stapler, through enabling laparoscopy - his work has left an indelible mark on the world. Thank you, Mr. Hirsch for your many contributions to the field of surgery and improving patient lives. Your legacy continues to live on in everything we do.\n\n,,,",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/be88e499-74a7-4fe7-b555-8c24994f3cde"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 35,
      "content": "Stethoscopes were once a doctor’s most trusted tool. In the future, I believe it will be \nhashtag\n#AI. Four months ago, I was named the chief technology and innovation officer at Medtronic. There’s one thing I’ve become sure of: the responsible, ethical use of AI has the power to radically improve healthcare. Patients will reap the benefits in areas ranging from cancer detection to increasingly precise surgeries.\n\nAs with any disruptive technology, there are naturally skeptics. Not me. I’m sharing some reasons for optimism in my latest article. I hope you’ll take time to read it and chime in with your thoughts.",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D5622AQHk7a2hucXefA/image_350_624/image_350_624/0/1699305125925?e=1757548800&v=beta&t=rHzHpFgOvaXmfxw5FhA5vM2lhCJXI9aHGZx-_4Th6QU"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 36,
      "content": "Great read from HBR that nicely highlights how \nhashtag\n#AI is helping business leaders (and in Medtronic's case, medical staff) make faster and more informed decisions. Here are some important statistics shared in the article:\n\n❓85% of business leaders have experienced decision stress\n❓75% have seen the daily volume of decisions they need to make increase tenfold over the last three years\n\nIn the case of hospitals and physician offices facing increased pressure and high volumes of patients, easing the decision-making process can not only improve productivity but ease stress.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 37,
      "content": "I recently had the opportunity to meet with Mike Marinaro, EVP & President of our Surgical business, have lunch with the team, and take a hard-hat tour of their new facility in Boston. When completed next month, it will house employees from Robotic Surgical Technologies, Ventures, and Clinical, Regulatory and Medical Affairs (CRMA). It will also provide more than 30 dedicated development and testing suites for the Hugo™ Robotic Assisted Surgery system. I am excited to see Boston become one more hub for’s technical talent, and confident it will fuel innovation across the entire company. Many thanks to the Surgical team for the great work you’re doing to impact patient lives every day.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 38,
      "content": "Sound design plays a critical role in the health tech industry. A robotic assisted surgery system uses dozens of sounds to communicate important messages to surgeons. Even to an untrained ear, the sound can communicate a clear message. Can you guess what this robot is saying?",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/b0bd1688-bf0c-4345-b3ca-1b450c567c7b"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 39,
      "content": "Today we released our first quarter \nhashtag\n#earnings for FY24. View a full recap of our performance here: https://lnkd.in/gZvCt4qw $MDT",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/911abfff-5752-4a3b-a0ac-b1ca789ed12d"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 40,
      "content": "When Medtronic merged its \nhashtag\n#surgicalinnovation and \nhashtag\n#robotics businesses earlier this year, the company chose Mike Marinaro to lead the team. \n\nIn Sydney recently, Mike said the opportunity to take Medtronic's heritage business and combine it with\nsuch as\nand\nwas a chance to \"embrace where we have been and chart the course for where we are going\".\n\n\"I see a future where we continue to push towards minimally invasive surgery while striving for efficiency in everything we do,\" said Mike. \"The greatest reward that we get is when we talk to our patients and their physicians about the impact of our technologies on them, their lives, and their loved ones.\"\n\nMike talks about his career, leadership and aspirations in.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 41,
      "content": "Incredible the thought, precision, and insight our teams take in designing our \nhashtag\n#surgical \nhashtag\n#technologies - with the customer and patient in mind. Smart \nhashtag\n#ergonomics could mean more surgeries in a day, longer, healthier surgeon careers, and, ultimately, more patients served.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 42,
      "content": "We're halfway through \nhashtag\n#SRS2023 in Australia, and we are having a blast! Thank you to all of our customers and partners who have stopped by our booth to say hello! Medtronic leaders Mike Marinaro, Rajit Kamal, andalso led some invigorating discussions on the latest advancements in robotic assisted surgery and AI.\n\nWe're excited for day 3 of SRS -- make sure to stop by our booth tomorrow for a\ndemo! 🤖",
      "timestamp": "",
      "engagement": {},
      "post_type": "image",
      "media_urls": [
        "https://media.licdn.com/dms/image/v2/D4E22AQG4tFs00jZIPQ/feedshare-shrink_800/feedshare-shrink_800/0/1690295738836?e=1757548800&v=beta&t=0vTUD84ERcZiBw9QJFNlAiu6-vsfVXJEcO6uqHo0o9M",
        "https://media.licdn.com/dms/image/v2/D4E22AQGX5VWRbx64lA/feedshare-shrink_800/feedshare-shrink_800/0/1690295739070?e=1757548800&v=beta&t=53wa4Wr776W_IhL1bilYWPVHt5uSEoUn0QhJyW-uWtM",
        "https://media.licdn.com/dms/image/v2/D4E22AQEoI06a9gkryw/feedshare-shrink_800/feedshare-shrink_800/0/1690295739007?e=1757548800&v=beta&t=KcooC1QDWtwOMwVqv36jlJnNMFWVDNKD4A1wSY3BRhI",
        "https://media.licdn.com/dms/image/v2/D4E22AQHKaFfVzkjMJg/feedshare-shrink_2048_1536/feedshare-shrink_2048_1536/0/1690295738935?e=1757548800&v=beta&t=GSEFLARYc411xpGKnB7x22-xEaNw_Jk9SOOGQtI49cY",
        "https://media.licdn.com/dms/image/v2/D4E22AQEgeNS-XmIJDQ/feedshare-shrink_800/feedshare-shrink_800/0/1690295739089?e=1757548800&v=beta&t=Oc49WxVs0OMeFxhUeVnd1xCyjbTEgjUw19qTjfwxui0"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 43,
      "content": "Medtronic is committed to partnering with surgeons around the world to solve our toughest healthcare challenges. Join leaders Mike Marinaro and Rajit Kamal as they share insights on the latest advancements.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 44,
      "content": "Honored and excited 2X! Medtronic is a finalist in the Surgical Robotics Technology 2023 Industry Awards.\n\n1) Outstanding Company — for our work to expand access to care to more patients in more places around the world with the Hugo™ RAS system + Touch Surgery™ Enterprise.\n\n2) Industry Leadership — recognizing Digital Technologies VP and GM,, for transforming surgical robotics by focusing on a super powerful non-robotic component: people.\n\nVoting is open now through June 13 so head over to the SRT site to show your support:",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 45,
      "content": "From expanding access to medical education and surgical training to uncovering new insights through video and data, digital technology is opening new frontiers in surgery for the betterment of patients around the world — and our London studio team is leading the way.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 46,
      "content": "Earlier today, Medtronic announced financial results for Q4 and FY23. Our solid results, built on momentum generated in Q3, led to a strong back half and finish to the fiscal year. I’m encouraged by the progress we’re seeing – growth acceleration, greater supply and market stability, further pandemic recovery, and meaningful portfolio wins.\n\nQ4 revenue growth was broad-based across all our portfolios, with mid-single digit organic growth in Cardiovascular, Neuroscience, and Medical Surgical, and double-digit growth in our Diabetes business in Western Europe. And with recent milestones, like the FDA’s approval of our MiniMed™ 780G System and CE Mark for our Affera™ Mapping and Ablation System, to name just a few, I’m optimistic about our robust product pipeline across the entire enterprise.\n\nFY23 was full of considerable transformation and change, and I want to thank our employees for their unwavering dedication. Their commitment inspires me, and I’m deeply grateful for our world-class team. Their efforts continue to advance the Medtronic Mission, ensuring millions of patients can get access to the life-transforming healthcare innovations they need. I couldn’t be more excited for what’s to come.",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 47,
      "content": "Today, Medtronic issued our Q4 FY23 results. Our fourth quarter organic revenue increased 5.6%, ahead of expectations. And our non-GAAP EPS of $1.57 grew 3%, was at the upper end of our guidance range, and exceeded consensus. I want to recognize our outstanding employees around the world, who have been helping to drive significant change to transform our company. And they have done this while keeping the Medtronic Mission front and center. Thank you for everything you do to make our company stronger and to always put patients first.",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/20db3328-63bb-4ff9-a9f6-93ca1f8926e0"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 48,
      "content": "Excited to harness the full power of our surgical portfolio to reach more patients around the world!",
      "timestamp": "",
      "engagement": {},
      "post_type": "text",
      "media_urls": [],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 49,
      "content": "Go, Hugo, go! At \nhashtag\n#SAGES2023 Montreal Canada \nhashtag\n#RoboticAssistedSurgery \nhashtag\n#FutureOfSurgery \nhashtag\n#BetterHandsBetterEyes\n\n\n\n\n\nPeter Dominick",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/b33d9ae5-2653-4d2d-bc1f-e631f9547fd8"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    },
    {
      "post_number": 50,
      "content": "Passion. Dedication. Partnership. These are just a few words to describe how we continue to build on our legacy. With the goal of increasing access to minimally invasive surgery around the world.",
      "timestamp": "",
      "engagement": {},
      "post_type": "video",
      "media_urls": [
        "blob:https://www.linkedin.com/42a755e5-801f-433a-9b9d-6dcbf295f786"
      ],
      "post_url": "",
      "profile_url": "https://www.linkedin.com/in/mike-marinaro-medtech/"
    }
  ]
}